{"0": "Roque Corral\nIndustria de Turbopropulsores S.A.\n28830 San Fernando de Henares, Madrid\nJanuary 25, 2012\nAbstract\nThe basic concepts of bladed-disk and dynamics and ﬂutter are reviewed. First and introduction\nto the engineering problems related with ﬂutter and its classiﬁcatios is given, then we review the basics\nof bladed-disk dynamics and unsteady aerodynamics for turbomachinery. Finally the tuned ﬂutter\nproblem is formulated and the problem of its computation aﬀordable computations is adressed- The\nmain objective is to make the reader aware of the physical origin of the concepts and their implications\nbut not to provide design rules that could be readily applicable to particular designs. 1\nIntroduction\nDynamic Aeroelasticity\nElastic and aerodynamic forces interact between them to construct the discipline that is known as aeroe-\nlasticity. When unsteady eﬀects are retained then aeroelastic eﬀects are referred to as dynamic.", "1": "There\nare three quite diﬀerent aeroelastic phenomena, namely, forced response, aerodynamic instabilities and\nﬂutter. The objective here is to review these three concepts to focus afterward in the aeromechanic\ninstability termed as ﬂutter. Flutter may occur in diﬀerent components, we will restrict ourselves here\nto bladed-disk ﬂutter although it is possible to see ﬂutter in other componens with or without cyclic\nsymmetry such as rotating seals, panels or vane packets for instance. Forced Response\nForced response of blades is due to the synchronous aerodynamic excitation of neighbouring blade-rows. These\nexcitations may be due to the upstream wake velocity defects (vortical perturbations) and/or to inviscid potential\npressure waves from either the preceding or following rows Hot streaks caused by combustor cams may give rise\nalso to vortical and entropy perturbations.", "2": "The excitation frequency is associated with the blade passing frequency\nand its higher or lower harmonics. The response occurs only at the crossings of the excitation frequency with\nthe natural frequencies of the bladed-disk for which the bladed-disk are responsive due to the matching of the\ncircumferential wave-length of the mode-shapes and the excitations, in other words for those modes for which the\nexcitation order is the same than the nodal diameter. Figure 1 (left) sketches how wakes coming from the preceding row impinge in the rotor and give rise\nto unsteady forces. On the right strain gage measurements of a bladed-disk subject to a clean forced\nresponse are plot. The experimental Campbell diagram shows the presence of diﬀerent modes represented\nby dark quasi-horizontal lines and their excitation by several engine orders.", "3": "RTO-EN-AVT-207 \n6 - 1 \n \n \nBladed Disks: Flutter   \n\n1\nIntroduction\nVKI-LS Structural Design of Aircraft Engines\n2\nForced Response\nFrequency\n30\n110\nN (%)\n70\n90\n50\nFigure 1: Scheme of the forced response working principle. Left: Conceptual scheme. Mid-\ndle: Actual FR case. Right: Experimental Campbell diagram. Aeroelastic Instability\nFrequency\n30\n110\nN (%)\n70\n90\n50\n0\n0\n1\n1\n0\n1\n0\n1\nFigure 2: Scheme of the aerodynamic instability working principle\nAerodynamic Instability\nAerodynamic instabilities do not require contribution of neighbouring blade-rows.", "4": "The aerodynamics may become\nunstable and cause unsteady perturbations. The simplest case is the vortex shedding behind a cylinder. The ﬂow\nseparates in the rear part due to adverse pressure gradient in the cylinder forcing the separation and oscillation\nof the ﬂow with a well deﬁned frequency range, (St = ωd/U∞≃0.2). This frequency does not correlate with the\nshaft speed of the engine and the excitation is referred to as non-synchronous. Vortex shedding due to the airfoil\ntrailing edges is just a conceptual model of the origin of the physical problem but it is not a problem in practice\nsince the excitation frequency is very high since d/c ≪1.", "5": "Engineering problems that fall under this category are\nrotating stall and buﬀeting for instance. Frequency excitation does not happen at pure tones but has a broadband contribution. This may be seen\nin ﬁgure 2 (right) where unsteady pressure measurements due to rotating stall are displayed. It may be\nappreciated the existence of several bands, not correlating with the shaft speed. The dynamic pressure\nassociated to these instabilities is of the order of the dynamic head and therefore the forces involve are\nusually very high.", "6": "However the response is not always visible since this depends on the coincidence with\na resonance. Flutter\nFlutter is deﬁned as a blade response due to an asynchronous aeroelastic instability of isolated airfoils. In the same\nline that aerodynamic instabilities the presence of neighbouring blade-rows is not needed. The main diﬀerence\nhere is that the airfoil motion is needed to develop an unstable behaviour, in other words while buﬀeting and\nrotating stall is a pure aerodynamic instability ﬂutter is an aeroelastic stability that requires the participation of\nthe structure. 6 - 2 \nRTO-EN-AVT-207 \n \n\n3\nVKI-LS Structural Design of Aircraft Engines\n1\nIntroduction\nFlutter\nFrequency\n30\n110\nN (%)\n70\n90\n50\nFigure 3: Scheme of Flutter working principle\nT\nm\np\nChoke Flutter\nTransonic Stall Flutter\nSubsonic Stall Flutter\nSupersonic Stall Flutter\nSupersonic Unstall Flutter\n25%\n75%\n50%\n100%\nChoke Line\nπ\nSurge Line\nOperating Line\nFigure 4: Classical flutter compressor map (Left) and compressor snubbers used to prevent\nflutter\nFrequency response is necessarily associated to structural modes since their participation is needed.", "7": "Figure\n? ? emphasizes that the instability may develop in a purely inviscid ﬂow without any kind of separation,\nbut the instability requires the presence of the structure. On the right the strain gage measurements of\na ﬂuttering bladed-disk may be seen. Flutter creates high response along several points usually of the\nspeed-line that do do coincide with any synchronous response.", "8": "The modulus of the unsteady pressure\nscales with the vibration amplitude on the contrary than in a pure aerodynamic instability. Phenomenological Classiﬁcation and Description\nFlutter is primarily seen in in fans, front and middle compressor blades and high aspect ratio low.pressure\nturbines. Flutter is not a concern for HPT since the are made of thick, low aspect ratio blades. The types\nof ﬂutter observed in compressor blading are usually displayed in a compressor map (see Fig. 4).", "9": "Flutter\ndoes not occur usually near the design point where compressor airfoils are operating close the nominal\nincidence, but at oﬀ-design conditions. The most common type of ﬂutter is stalled ﬂutter that is seen\nin fans and front compressor stages. A standard design criterion is to require that the ﬂutter margins is\nhigh enough to avoid it in all the operating range, however with the recent improvements in surge margin\ntoday is diﬃcult to provide enough ﬂutter margin to handle engine-to-engine variation and deterioration. Supersonic unstalled ﬂutter is easily seen in shrouded fans, however the design of shrouded fans is not a\nmodern design practice. This type of ﬂutter tends to occur at climb conditions close to the maximum\ncorrected speed.", "10": "Choke ﬂutter is much less common and it is restricted to rear compressor stages. Low-pressure turbine ﬂutter may be detected in any high aspect ratio,H/c, rotor blade or vane. Flutter\nis detected in a wide envelope of the turbine operating range, but the most critical point is associated\nto Maximum Take-oﬀconditions where both the mechanical shaft speed and the turbine inlet pressure\nreach their maximum. RTO-EN-AVT-207 \n6 - 3 \n \n\n1\nIntroduction\nVKI-LS Structural Design of Aircraft Engines\n4\n1991\n1992\n2001\n2\n4\n6\n8\nT1000\nT900\nT500\nT800\nWelded−Pair\nInterlock\nT700\nAspect Ratio = Height/Chord\nyear\n1997\n2005\nFigure 5: Evolution of LPT rotor blade aspect ratio\nFlutter occurred in early cantilever LPT designs (1F) on Pegasus, RB145, etc. during the development\nphase, the ﬁx was based in adding lacing wires or shrouds.", "11": "Plain sided shrouds which had clearance\nat operating conditions ﬂuttered as well in 1st ﬂexural modes (Dart and Conway engines). The move\nto interlock shrouds, supposed to remain tight throughout the running range, gave rise to vibration\ncharacteristics similar to the ones encountered in snubbered fans that gave rise to ﬂutter of complex\nmodes. Figure 5 displays the rotor blade aspect ratio evolution of a family of large civil aeroengines. It may\nbe seen that in the early 90’s relatively large aspect ratio were designed and manufactured and that the\ninterlock conﬁguration, where the rotor blades are supposed to remain in tight contact during the whole\nﬂight envelope was abandoned in favour of cantilever blades welded-in-pair. The ultimate goal of welding\nthe rotor blades in pairs was to mitigate ﬂutter eﬀects by providing additional aerodynamic damping.", "12": "The drop and raise of the aspect ratio with time is associated to a combination of development problems\nin previous designs, change of design targets and improvements in prediction methodologies based in a\nmore intensive use of simulation tools. Design limitations associated to the Flutter of NGVs in the last stages of LPTs are not uncommon,\nCompressor and turbines vanes are grouped in packets to reduce manufacturing costs. The number of\nvanes per packet ranges between 3 and 10. Flutter of vanes packets has unique ingredients since vane\npackets include modes which are very close in frequency that may interact among them [1, 2]. Mathematical Classiﬁcation\nFlutter may be classiﬁed also from a mathematical point view.", "13": "This is interesting since it helps to\ndetermine the level of modelling that it is required for each problem. Classical ﬂutter is encounter\nwhen just a single well separated unstable mode is encounter and the aerodynamics is linear since there\nare not highly non-linear phenomena, such as shock waves or separation. The perturbed unsteady ﬂow\nmay be considered as a small perturbation of the mean ﬂow and may be computed using linear methods. This type of ﬂutter may be seen in subsonic low-pressure turbines and compressors. Non-linear ﬂutter happens for single-mode non-linear aerodynamics.", "14": "Most, if not all, fan and compressor\nﬂutter types fall under this category. Choke and supersonic unstall ﬂutter features shock waves that\nare responsible of the instability. Stall ﬂutter is based in the presence of large vortices and separated\n \n \n6 - 4 \nRTO-EN-AVT-207 \n \n\n5\nVKI-LS Structural Design of Aircraft Engines\n1\nIntroduction\nregions interacting with the structure. Their simulation require non-linear aerodynamic models but some\nengineering approaches based in linear analysis and experience are also possible. Coalescence ﬂutter refers to instabilities that are caused due to the interaction among several modes .", "15": "The simplest case is the classical bending-torsion interaction that may be see in aircraft wings. The\nexistence of coalescence ﬂutter requires the presence of high enough aerodynamic forces that may couple\nthe purely structural modes. Bladed-disks are designed to have separated mode families in terms of\nfrequency but there are cases in which this interaction is unavoidable like in vane packets where several\nstructural modes with nearly the same frequency may be found. Low density bladed-disks like fans and\npropfans may experience coupled ﬂutter due to frequency corrections due to aerodynamics eﬀects. Classical Flutter\nThe main hypotheses involved are that the ﬂow remains attached to the airfoil and the instability is\ninduced solely by the phase diﬀerence between the structure motion and the induced aerodynamics\nforces.Another implicit hypothesis is that a single mode is involved because diﬀerent modes are well\napart in terms of frequency, we will expand this issue latter on to properly deﬁne the concept of separated\nmodes.", "16": "Bladed-disk ﬂutter add another particularity, namely that the diﬀerent airfoils of the bladed-disk\ninteract aerodynamically among them. As it has already been mentioned this type of ﬂutter may be seen\nin intermediate- and low-pressure turbines\nClassical ﬂutter may be readily understood analysing whether the ﬂow extract or communicate energy to\nthe airfoil. The standard form of looking at this problem is calculating the work-per-cycle performed\nby the ﬂuid ion the airfoil that may be expressed as\nWcycle =\nZ T\n0\nZ\nΣblade\npVblade.dAdt\n(1)\nif neither the velocity of blade,Vblade(t), nor the pressure on the airfoil surface, depend on the airfoil\nposition then the work per cycle reduces to\nWcycle =\nZ T\n0\nVblade(t).F(t)dt. (2)\nLet us assume that the blade undergoes an harmonic motion, xblade = x0 sin ωt, thus the blade velocity is\nVblade = ωx0 cos ωt, and that the blade force leads its displacement by an angle ψ, i.e. F = F0 sin(ωt+ψ)\nthen the work-per-cycle is\nWcycle = ωx0F0\nZ 2π/ω\n0\ncos ωt sin(ωt + ψ)dt = πx0F0 sin ψ\n(3)\nIf ψ > 0, the structure absorbs energy from the ﬂow and the system is unstable.", "17": "It is important to\nhighlight that ﬂutter depends solely in the phase between the airfoil displacement and the aerodynamics\nforce. Another form of looking at the problem is by representing the forces and displacements in the complex\ndomain. In this case Wcycle = Re( ˆF ˆv) = Re( ˆFiωˆx) = −ωxRFI, and therefore the sign of the work is\ncontrolled by the imaginary part of the force which is nothing that the phase between the force and the\ndisplacement. The relationship between the work-per-cycle and the phase is illustrated in ﬁgure 6. If a force is applied\non the airfoil and as a consequence the airfoil is displaced a positive work is performed and the structure\nabsorbs energy.", "18": "If forces and displacements are exactly in phase (ψ = 0) or anti-phase (ψ = π), the\nsystem is conservative and the work dissipated per cycle is null. RTO-EN-AVT-207 \n6 - 5 \n \n\n2\nBladed-Disk Dynamics\nVKI-LS Structural Design of Aircraft Engines\n6\nωt\nπ\n2\nF\nx\nV\nψ\nωt\nsinψ\nPower\nωt\nsinψ\nPower\nωt\nπ\n2\nx\nV\nF\nψ\nForce Lead →Structure absorbs Energy\nForce Lag →Structure releases Energy\nFigure 6: Work-per-cycle for two different phasing between the force and the displacement\n2\nBladed-Disk Dynamics\nA simple model is presented to describe the key elements of bladed-disk dynamics. Diﬀerent asymptotic\nlimits are analysed to obtain analytical description of some of the more well known behaviours\nIntroduction\nLinear bladed-disk dynamics is computed today routinely by gas turbine manufacturers using ﬁnite\nelement methods. Complex blade shapes and disks are discretised using automatic grid generators, the\ngoverning equations are written in discrete form and the eigenvalue problem of set of ordinary diﬀerential\nequations solved to obtain the natural frequencies and the mode-shapes.Frequencies are needed to relate\nthem with the shaft speed and construct Campbell diagrams and mode-shapes to derive aerodynamic\ndamping and alternate stresses. The third building block of the bladed-disk dynamics, namely, the modal\ndamping may not readily derived from FE computation and will not be addressed here.", "19": "Rotor blades are coupled with their neighbours via the structural connections that inevitably exists either\nthrough the disks, the casings in the case of stator vanes, or through the shroud rings that are included\nto stiﬀen the assembly. The structural coupling among diﬀerent rotor blades signiﬁcantly inﬂuences the\nnatural frequencies and mode-shapes of the assembly and need to be retained in the simulations. Analysis\nincluding just a single blade must be regarded as ﬁrst step in the simulation process. Perfectly tuned bladed-disks exhibit cyclic symmetry. This means that the whole wheel may be split in\nN identical sectors, probably containing several airfoils as it is always the case for sectored vanes, and\nimpose cyclic boundary conditions in the periodic boundaries to reduce the computational domain from\nthe whole wheel to a single sector largely reducing the computational time require to solve the problem.", "20": "Bladed-Disk dynamics has been well reported. Here our interest here is to make a very short review of\nthe underlying concepts resorting to a simpliﬁed lumped model that contains all the key ingredients. Disks, or any continuous structure with cyclic-symmetry vibrate in double nodal diameters (see Figure\n7). Nodal diameters are the locus of the points with zero displacement that traverse radially the disc. Mode-shapes with more nodal diameters have higher natural frequencies since the mode is stiﬀer.", "21": "As the\nexcitation frequency increases the disk may exhibit nodal circles which are points at constant radius with\nzero displacement. Bladed-Disks are constructed ﬁxing rotor blades to a disk, either using ﬁr-tree or dove tail attachments,\nor welding the rotor blades to the disk or even machining integral parts with disks and blades as it is\nusually the case in small compressors (Blisks). In any case with a large degree of generality it may be\n \n \n6 - 6 \nRTO-EN-AVT-207 \n \n\n7\nVKI-LS Structural Design of Aircraft Engines\n2\nBladed-Disk Dynamics\nND=2\nND=3\nNC=2\nNC=3\nFigure 7: Sketch of disk mode-shapes. Left: Nodal diameters. Right: Nodal circles\n1st Blade Alone\nMode\n1st Bladed Disc\n        Family\nFrequency\n1st Disc Family\nND\nFigure 8: Sketch of the natural frequencies of a bladed-disk as a function of the nodal\ndiameter\nstated that for very stiﬀdisks the lower natural frequencies are dominated by blade-alone modes, i.e.", "22": ":\nmodes which are very similar to those that can be obtained clamping the rotor blade at the root, while\nfor ﬂexible disks the rotor blade and the disk modes may interact. Figure 8 displays the frequency versus the nodal diameter of a generic bladed-disk. The horizontal\nfrequency represents the frequency that would be obtained by clamping the rotor blade at the attachment\nthat does not depend on the nodal diameter since the disk is not included in the representation. The\nparabola-like curve represents the natural frequencies of the disk alone, that increase with the nodal\ndiameter. The blend between these two curves is the bladed-disk 1stfamily of modes.", "23": "It may be observed\nthat for low nodal diameters the system is dominated by disk modes, while for high nodal diameters the\nbladed-disk natural frequencies corresponds in ﬁrst approximation with that of the rotor blade alone. The questions that arises immediately are: What does exactly mean a rigid disk? or How ﬂexible need\nto be a disk to see the disk dynamics? or How high need to be a nodal diameter to see just the rotor\nblade dynamics? We will try to answer this question by looking at a simpliﬁed bladed-disk model.", "24": "Figure 9 show the frequency versus the nodal diameter of a low-pressure turbine real bladed-disk computed\nusing a FE model. Several families of the assembly are plot, but it may be seen that all of them have the\nsame structure that that sketch in ﬁgure 8. Low nodal diameters correspond to long wave-length modes\nwhile high nodal diameters have short wave-length and essentially the same frequency. This structure of\nthe purely structural eigenvalues applies to any kind of bladed-disk. Bladed-Disk Lumped Model\nA tuned bladed-disk formed by a disk and a set of rotor blades attached to it, may be represented from\na conceptual point of view as a ring on N identical masses, Md joined by a spring of stiﬀness, kd that\nRTO-EN-AVT-207 \n6 - 7 \n \n\n2\nBladed-Disk Dynamics\nVKI-LS Structural Design of Aircraft Engines\n8\n0\nMax\nND\nNodal Diameter\nNormalized frequency\nND = 3\n1st Family\n2nd Family\n3rd Family\nDisk Mode\nFigure 9: Typical natural frequency vs nodal diameter plot of a bladed-disk\nk b\nk d\ny\ni\nM i\nm i\nx i\nFigure 10: Simplest lumped model of a bladed-disk\nrepresents the disk and N identical masses mb, that represent the rotor blades, linked to the disk through\na spring of stiﬀness, kb.", "25": "The governing equations of the simpliﬁed bladed-disk are:\nDisk :\nMd\nd2xj\ndt2\n=\nkdisc(xj+1 −xj) −kdisc(xj −xj−1) + kblade(yj −xj)\nBlade :\nmb\nd2yj\ndt2\n=\n−kblade(yj −xj)\n(4)\nThat in non-dimensional form become:\nµd2xj\ndτ 2\n=\nκ(xj+1 −2xj + xj−1) + (yj −xj)\nd2yj\ndτ 2\n=\n−(yj −xj)\n(5)\nwhere µ = Md\nmb\nis the disk to blade mass ratio , κ = kdisc\nkblade\nthe disk to blade stiﬀness ratio and τ = t\ntc\nthe time non-dimensionalised with the inverse of the blade alone natural frequency tc =\nr mb\nkblade\n. This is a system of 2N linear ODEs which is periodic in space and we seek for periodic solutions both in\ntime and space. Since the problem is linear we may solve the problem harmonic by harmonic, i.e. :\nxj = bxei(nθj+eωt) and yj = byei(nθj+eωt)\n(6)\nwhere θj=j 2π\nN and n = 0, . .", "26": ". , ±N/2 if N is even. Introducing the previous equation in the governing\nequations we obtain:\n \n1 −µeω2 + 4κ sin2 n∆θ\n2\n−1\n−1\n1 −eω2\n! (\nbx\nby\n)\n=\n(\n0\n0\n)\n(7)\n \n \n \n6 - 8 \nRTO-EN-AVT-207 \n\n9\nVKI-LS Structural Design of Aircraft Engines\n2\nBladed-Disk Dynamics\nThe characteristic equation providing the eigenvalues is thus:\nµeω4 −\n\u0014\n(µ + 1) + 4κ sin2 n∆θ\n2\n\u0015\neω2 + 4κ sin2 n∆θ\n2\n= 0\n(8)\nThe natural frequencies of the problem depend therefore of three parameters:\nω2\nn\nω2\nblade\n= f\n\u0012\nµ = Mdisk\nMblade\n, κ = Kdisc\nKblade\n, Θ = n∆θ = 2π n\nN\n\u0013\n(9)\nthe disk to blade mass ratio, µ, the disk to blade mass stiﬀness, κ, and the non-dimensional wave number\nor nodal diameter, Θ. Equation 8 is a second order algebraic equation in ˜ω2 that can be solved analytically\nbut it is more interesting to look at some asymptotic limits.", "27": "Mathematical and Physical Interpretation\nThere are a number of consequences that may be derived from the mathematical structure of the problem\nthat have their physical counter part. 1. First of all all the eigenvalues, ˜ω2, of the model problem are real. This may be readily seen by\nnoting that the characteristic equation 8 is a second order equation of the form eω4 −2beω2 + c = 0\nwhose solution is eω2 = b ±\n√\nb2 −c. Since b and c are always greater than zero, and b2 > c, then\n˜ω2 is always real and greater than zero.", "28": "This physically means that the system is not damped and\nconserves the energy since the solution may be expanded in sines and cosines of constant amplitude\naccording with Eq. 6. 2. The eigenvalues are double since Eq. 6 does not change for positive or negative nodal diameters or\nwave numbers, n. This means that from a purely structural point of view the system is symmetric.", "29": "The wave-length of the waves is λ = 2π/n. 3. From a mathematical point of view the natural form of looking at the solution is as pairs of forward\nand backward travelling waves of wave-length λ and phase velocity c = ±˜ω/n\nx(t) = An cos(nθ + eωt) + Bn cos(nθ −eωt + φ)\nhowever this solution may be recombined and expressed as two standing-waves, setting φ = 0, of\nthe form\nx(t) = (An + Bn) cos(nθ) cos(eωt) −(An −Bn) sin(nθj) sin(eωt)\nwhich is the standard form that FE packages provide the mode-shapes and laboratory experiments\nsee bladed-disk assembly mode-shapes when they are excited in a stationary frame of reference. Asymptotic Limits\nTo increase the understanding of this model problem let us consider the following asymptotic limits:\n1. The disk is much heavier than the rotor blades, i.e.", "30": ": µ ≫1\n(a) κ ∼0(1) or κ ≪1\n(b) κ ≫1\nRTO-EN-AVT-207 \n6 - 9 \n \n\n2\nBladed-Disk Dynamics\nVKI-LS Structural Design of Aircraft Engines\n10\nθ\nt\n+c\n−c\nt\n2π/n\nsin kθ\nθ\nt\ncos k\nt\nθ\nθ\nFigure 11: Sketch of standing- (top) and travelling-wave (bottom) solutions\nκ/µ\n0\nblade\nω\nωdisc\n0(κ/µ)\n0\n1\nND\nN/2\nω\nFigure 12: Natural frequency vs nodal diameter of a bladed-disk with µ ≫1 and κ/µ ≪1\n2. Blade and disk masses are comparable, i.e. : µ ∼1\n(a) High nodal diameters n/N ≫κ−1/2\n(b) Low nodal diameters n/N ≪κ−1/2\nHeavy and Relatively Flexible Disk\nIf the disk is much heavier than the blades (µ ≫1), the 0th order dispersion relation reduces to\nµω4 −µω2 = 0 , that basically means that the disk natural frequencies are very low, zeor in ﬁrst\napproximation,ω2\nDisk = 0, and the rotor blades natural frequencies correspond the blade-alone frequency,\ni.e. : ω2\nBlade = 1 in non-dimensional form. Disk and Blades frequencies are well apart and they do not\ninteract among them.", "31": "Rotor blade vibrates at its natural blade and the disc does not move. Next terms\nof the expansion are:\nωDisk = 2\nrκ\nµ sin Θ\n2 and ωBlade = 1 −2κ\nµ sin2 Θ\n2\nand the corrections are small provided that κ/µ ≪1. This limit is not seen in practice since although\ndisks of industrial gas turbines may be much heavier than the blades they are also stiﬀand κ ∼µ. Heavy and StiﬀDisk\nIf the disk is much heavier and, consequently, stiﬀer than the rotor blades, µ/κ ∼o(1) , the situation is\na bit diﬀerent. In the previous case disk dynamics decouples from the blade because their characteristic\ntimes were very diﬀerent.", "32": "Now this is not true anymore but the disc is very stiﬀand has an independent\nbehaviour. In this case the approximate solutions are: ωblade = 1 and ωDisc = 2\nrκ\nµ sin Θ\n2 . The\napproximate disc equation is now: d2xj\ndτ 2 = κ\nµ(xj+1 −2xj +xj−1) which is decoupled from the rotor blade\ndynamics. 6 - 10 \nRTO-EN-AVT-207 \n \n\n11\nVKI-LS Structural Design of Aircraft Engines\n2\nBladed-Disk Dynamics\n1+µ\nµ\nn\nN\nκ\nµ sin πn\nN\n2\nκ\n1+ µ\n2πn\nN\nκ−1/2\n1\n1\nBlade\nDisc\nω\nFigure 13: Natural frequency as a fucntion of the nodal diameter of the modal problem for\nµ ∼o(1)\nDisk and Blade Masses Comparable\nThe standard case in real life is that the mass of the disk and the rotor blades is comparable (µ ∼o(1)). This is true for low-pressure turbines and compressors while high-pressure turbines tend to have much\nheavier disks due to shaft rotational speed and temperature eﬀects and in the same direction compressor\nblisks tend to have very light blades.", "33": "The dispersion relation may be written as:\neω4 −\n\u0014\u0012\n1 + 1\nµ\n\u0013\n+ 4\n\u0012κ\nµ\n\u0013\nsin2 Θ\n2\n\u0015\neω2 + 4\n\u0012κ\nµ\n\u0013\nsin2 Θ\n2 = 0\n(10)\nDiﬀerent expansions for the solution may be obtained for High Nodal Diameters: n\nN ∝Θ ≫κ−1/2 or\nLow Nodal Diameters: n\nN ≪κ−1/2 , otherwise the dispersion relation may not be simpliﬁed. The derivation of the expansions for the diﬀerent limits are a simple exercise of regular/singular pertur-\nbations and are left to the reader as a simple exercise. The main conclusions are outlined in the following\nlines. • If 4\n\u0010\nκ\nµ\n\u0011\nsin2 Θ\n2 = 1\nϵ ≪1 or κΘ2 ≪1, the low nodal diameter region which is dominated by the disk\ndynamic is obtained. The dispersion relation reduces to:\neω4 −\n\u0012\n1 + 1\nµ\n\u0013\neω2 = 0\n(11)\nand hence the natural frequency of the disk in zero in ﬁrst approximation, eω2\nDisk = 0, and the\nnatural frequency of blade dominated modes experience a correction due to the Disk mass, eω2\nBlade =\n\u0010\n1 + 1\nµ\n\u0011\n.", "34": "The governing equations for nodal diameters satisfying the condition n/N ≪κ−1/2 are:\nµd2xj\ndτ 2\n=\n(yj −xj)\nd2yj\ndτ 2\n=\n−(yj −xj)\nor\nd2(µxj + yj)\ndτ 2\n=\n0\nµd2(xj −yj)\ndτ 2\n=\n(1 + µ)(yj −xj)\n(12)\n– The 1st equation represents a rigid body motion of the center of mass of the sector (\n˜\nωDisk\n2 = 0)\nof the sector. RTO-EN-AVT-207 \n6 - 11 \n \n\n3\nUnsteady Aerodynamics\nVKI-LS Structural Design of Aircraft Engines\n12\nk b\nM d\nmb\nFigure 14: Dynamic model representative of a blade-disk low nodal diameter motion\n– The 2nd equation is an harmonic motion with a natural frequency of ω2 = 1+µ\nµ . The blade and\nthe disk move in anti-phase while the center of mass of the assembly is ﬁxed. The equivalent\nsystem is the following:\nEverything happens as if the disk sectors were uncoupled among them and the rotor blade and the\ndisk were joined through a spring of stiﬀness kb. • If 4\n\u0010\nκ\nµ\n\u0011\nsin2 Θ\n2 = 1\nϵ ≫1,or κΘ2 ≫1, the high nodal diameter limit of the problem is obtained.", "35": "The dispersion relation reduces in this case to:\nϵeω4 −eω2 + 1 = 0\nand hence eω2\nDisk = 1\nϵ and eω2\nBlade = 1. The natural frequency of the rotor blade dominated modes\nis the same a similar to that of the blade alone case\n• if ϵ ∼1 , or n/N ∼κ−1\n2 , no simpliﬁcation is possible\n3\nUnsteady Aerodynamics\nIntroduction\nUnsteady aerodynamics associated to vibrating airfoils is complex and little can be said with a large degree\nof generality.Computational methods based on the solution of the linearized Navier-Stokes equations are\nwidely used in the gas turbine industry, and even fully non-linear unsteady methods are used for some\nspeciﬁc problems. The accuracy of computational method is acceptable for most of the cases, especially\nwithin the industry where codes have been tuned for speciﬁc ﬂows, however the physical understanding\nof these ﬂows is reduced. Unsteady pressure distributions have little to do with steady pressure ﬁelds and the variability is even\nlarger. To begin with the base mean ﬂow has a strong inﬂuence in the perturbations.", "36": "Steady aerodynamics\nof low-pressure turbines which is a high subsonic Mach number ﬂow subject to a large turning, has little to\ndo with compressor aerodynamics that may even change dramatically from operating point to operating\npoint. Compressor ﬂows have low turning but may include shock waves at diﬀerent positions. Moreover\nnew parameters such as the reduced frequency, or Strouhal number, the phasing between the vibration\nof neighbouring airfoils or the mode-shapes themself appear, making the variability of the problem very\nlarge. On the top of that the unsteady pressure itself is not the main interest of the aerolastic analyst,\nbut the aerodynamic damping, that depends complety on the phasing between the unsteady pressure\nand the blade surface. For all these reasons and general view of the unsteady aerodynamics of vibrating\nairfoils in turbomachinery is not available.", "37": "Large modulus of unsteady pressure may be seen in high velocity regions, such as the pressure side of\nturbines and high gradient regions, such as the vecinity of shock waves (see Fig. 15). 6 - 12 \nRTO-EN-AVT-207 \n \n\n13\nVKI-LS Structural Design of Aircraft Engines\n3\nUnsteady Aerodynamics\nFigure 15: Unsteady pressure of a transonic compressor vibrating in flap mode. Unsteady Aerodynamics of Vibrating Airfoils\nThe order of magnitude of the modulus of unsteady pressure of a vibrating airfoil with amplitude δmax\nand angular frequency ω, may be estimated is may be estimated using the momentum equation of an\ninviscid ﬂow\nρDv\nDt = −∇p\n(13)\nIf we assume that the ﬂow may be decomposed in a mean ﬂow where v = v0(x) + v′(x, t), p = p0(x) +\np′(x, t) where the sub-index 0 denotes mean ﬂow and the prime the unsteady perturbed variables. The\norder of magnitude of the unsteady perturbation, ∆pc, may be estimated as\n∆pc ∼ρUcωδmax max(1, k)\n(14)\nwhere the reduced frequency, k, or the Strouhal number,St , is deﬁned as k = ωc/Uc,where c, is the chord\nor the characteristic length and Uc is a characteristic velocity.", "38": "For ﬂutter cases the reduced frequency is\nof order unity, typically k < 1 and therefore in practice\n∆pc ∼ρUcωδmax. (15)\nThe unsteady force in the airfoil is then\nF a ∼ρUcωδmaxS = Fc\n(16)\nwhere S is the airfoil surface. The unsteady forced in the jth-airfoil may be expressed as:\nF a\nj = Fc eF(k, σ, t). (17)\nThe inter-blade phase angle (IBPA) σ is the phase diﬀerence between two adjacent airfoils and is directly\nrelated with the nodal diameter. Figure 16 sketches the vibration of a compressor airfoil with σ = 90◦.The\nminimum ﬂow unit needed to represent this vibration is four passages.", "39": "Airfoils 2 and 4 have reached its\nmaximum deﬂection and vibrate in anti-phase while airfoils 1 and 3 are passing through its zero deﬂection\nposition but with opposite velocities. Nodal diameter ND = Nb/2 corresponds with σ = 180◦and has\nRTO-EN-AVT-207 \n6 - 13 \n \n\n3\nUnsteady Aerodynamics\nVKI-LS Structural Design of Aircraft Engines\n14\n2\nσ =90\nUc\n1\n3\n4\n1\nω\nC\nδmax\nFigure 16: Inter-blade phase angle interpretation\nthe shorter wave-length corresponding to two passages, while ND = 1 corresponds to σ = 2π/Nb and\nwould involved the simulation of the whole wheel. The most distinctive feature of the unsteady aerodynamics of vibrating airfoils in turbomachinery is that\nthe unsteady force in the jth-airfoil depends on the motion of all the airfoils,\nF a\nj = Fc eFj(k, x1, x2, . . .", "40": ", xj, . . . , xN, t)\n(18)\nIn the particular case that the airfoils motion is harmonic in time, xj = bxωeiωt and that all the airfoils\nmove with a common inter-blade phase angle, xj = bxneinxj, then the force in the airfoil j, may be\nexpressed as a summation of the contribution of the diﬀerent temporal and spatial harmonics\nF a\nj = Re(Fc\nX\nω\nX\nn\nbFn,ω(x)ei(nxj+ωt))\n(19)\nMoreover, if the unsteady perturbations are much smaller than the mean ﬂow, p′(x, t) ≪p(x), the\nunsteady aerodynamics is linear. A necessary condition is then that\n∆pc\npc\n∼ρcUcωδMax\npc\n∼M 2StδMax\nc\n(20)\nthat always can be achieved if the blade displacements are small enough, δMax/c ≪1 and typically\nδMax/c ∼10−2.", "41": "In this case the solution is harmonic in time, i.e. : composed in ﬁrst in ﬁrst approximation\nof a single harmonic corresponding with the vibration frequency. The contribution of higher harmonics\nis negligible since are the results of non-linear interactions,\nF a\nj = Re(Fc\nX\nn\nbFnei(nxj+ωt))\n(21)\nThe unsteady pressure, or any perturbation variable, are also proportional to the vibration amplitude\nand therefore it is interesting to scale the blade force with δMax\nF a\nj = Re(Fc/δmax\nX\nn\nbfn(ω)bxnei(nxj+ωt))\n(22)\nIt is interesting to note that the unsteady force Fourier coeﬃcients, bfn, depend on the non-dimensional\nangular frequency and the inter-blade phase angle, bfn(k = ωc/Uc, σ) and are complex numbers since\naerodynamics eﬀects translates in an apparent stiﬀness (Real part) and damping (Imaginary part)\n \n \n6 - 14 \nRTO-EN-AVT-207 \n \n\n15\nVKI-LS Structural Design of Aircraft Engines\n3\nUnsteady Aerodynamics\nn\nVw\nΣ\nFigure 17: Moving surface of a vibrating airfoil\nAerodynamic Work-per-Cycle\nRelationship with Aerodynamic Coeﬃcients\nThe work-per-cycle performed by the aerodynamic\nforces is\nWaero =\nZ T\n0\n\u0012Z\nΣ\np(x, t)Vw.ndA\n\u0013\ndt\n(23)\nIf we assume that there is no spatial dependency of the pressure to simplify the formulation, i.e. : p = p(t),\nand the same is true for the airfoil motion, Vw = Vw(t), then\nZ\nΣ\np(x, t)Vw(x, t).ndA = Vw. Z\nΣ\np(t)ndA = Vw.F(t)\n(24)\nand we seek harmonic solutions xw = bxeiωt ⇒Vw(x, t) = iωbxweiωt and F = bFeiωt then the work per\ncycle is Wwork−per−cycle = π( bFIbxR−bFRbxI).", "42": "If we set the time origin such as x = ˆxR cos ωt, (i.e. : ˆxI = 0),\nthen\nWwork−per−cycle = π bFIbxR\n(25)\nThis means that the damping is associated to the imaginary part of the forced coeﬃcient. In the general\ncase that the pressure and the mode-shape are a function of the position the same result may be obtained\nif the order of the spatial and temporal integral is exchanged. Non-Dimensional Aerodynamic Work\nAerodynamic work-per-cycle, Waero, may be scaled from a\npure aerodynamic point of view using the unsteady pressure estimate (Eq. 15) as\nΘ =\nWaero\n2πρUcωδ2S\n(26)\nThis non-dimensionalization absorbs the quadratic dependency with the amplitude that is obtained for\nlinear aerodynamics.", "43": "Non-dimensional aerodynamic work, Θ, depends on the following parameters\nΘ = Θ(\nk\n|{z},\nMode-shape,\n|\n{z\n}\nδ\nc\n|{z}\n,\nM , Re , αin\n|\n{z\n})\nFreq. IBPA+Family\nNon-Linear\nSteady-Field\n(27)\nReduced frequency, k, is usually used as a target design criterion to ﬁx ﬂutter problems, both in the\nconceptual and in the detailed design phase. Natural frequencies are raised either increasing the blade\nchord, the thickness or both. The most powerful mechanism of controlling the reduced frequency is the\nblade aspect ratio. However aerodynamic damping sensitivity with the mode-shape is much larger.Damping change strongly\nwith the inter-blade phase angle, σ, but even focusing in the most critical σ, the position of the centre of\ntorsion of the airfoil may dramatically change the aerodynamic damping.", "44": "The most clear example is the\nRTO-EN-AVT-207 \n6 - 15 \n \n\n3\nUnsteady Aerodynamics\nVKI-LS Structural Design of Aircraft Engines\n16\nchange in aerodynamic damping between ﬂap and torsion modes. The center of torsion location must be\ncarefully controlled to drive the designs in the right direction. Aerodynamic damping is in general insensitive to the vibration amplitude except in particular non-linear\nproblems, such as shock ﬂutter, where the aerodynamic damping may even change of sign with the\nvibration amplitude. Steady aerodynamics ﬂow-ﬁeld obviously change the aerodynamic damping and is responsible of the\ncompletely diﬀerent behaviour of compressor and turbines, but for a given application the variability\nwith the Mach number for instance is reduced since this is ﬁxed by purely aerodynamic criteria and it\nis not a free parameter. Sensitivity of the aerodynamic damping to the Reynolds number is small, since\nthe unsteady pressure caused by the airfoil motion are mainly an inviscid phenomenon.", "45": "Perhaps the only\nexception would be compressor stall ﬂutter where separation is controlled by viscous eﬀects. Incidence\nchange caused by shaft speed variation may heavily change the ﬂow-ﬁeld and hence the aerodynamic\ndamping, especially in compressors. Aerodynamic damping may be also scaled assuming that it will take part of the airfoil motion equations,\nthat for a single degree of freedom systems take the form:\nm¨x + c ˙x + kx = 0\n(28)\nthat may be non-dimensionalised using τ = ωnt and ˙x = x′ωn to obtain\nx′′ + 2ξx′ + x′ = 0\n(29)\nwhere the Critical Damping Ratio, ξ, is deﬁned as ξ = c/2mωn. Viscous damping, c, is related with\nthe aerodynamic forces as c =\n1\nωn Im( ˆFa/ˆxR), where ˆxR is the real part of the displacement that in practice\nmay be translated as the maximum displacement of the airfoil, ˆxR = δmax. Taking into account that the\nimaginary part of the aerodynamic force and the aerodynamic work are related by ˆFa = Waero/˜xR, the\ncritical damping ratio reduces to\nξ =\n1\nmω2n\nWaero\n2πδ2max\n(30)\nwhich is nothing else that another form of non-dimensionalizing the aerodynamic work.", "46": "The aerodynamics\nwork is usually obtained from an unsteady aerodynamic simulation while m, here is the modal mass. Critical damping ratio and non-dimensional work are related by the expression\nξ = ΘρUcS/mωn = µΘ/k\n(31)\nwhere µ = ρcS/m which is a measure of the ratio between the mass of the air surrounding the airfoil\nand the mass of the blade, µ ∼mair/mblade. It must be noticed that a change of the blade material\ndensity may change the critical damping ratio while leaving unaﬀected the non-dimensional aerodynamic\nwork-per-cycle which is a purely aerodynamic quantity. Reduced Frequency and Mode-Shape Eﬀects in Turbines\nIt has already been mentioned that to increase the reduced frequency is the most standar mechanisms\nto stabilise unstable conﬁgurations. To illustriate this phenomenon we have chosen a state of the art\nlow-pressure turbine aifoil.", "47": "6 - 16 \nRTO-EN-AVT-207 \n \n\n17\nVKI-LS Structural Design of Aircraft Engines\n3\nUnsteady Aerodynamics\nξ\nη\nEdgewise\nFlap\nTorsion\nFigure 18: Description of fundamental mode-shapes\n−180\n−180\n−180\n−90\n−90\n−90\n0\n0\n0\n90\n90\n90\n180\n180\n180\nIBPA [deg]\nIBPA [deg]\nIBPA [deg]\n−5\n0\n5\n10\n15\nDamping Coefficient\n−5\n0\n5\n10\n15\n20\nDamping Coefficient\n−5\nUnstable\nStable\nUnstable\nStable\nUnstable\nStable\n0\n5\n10\n15\n20\n25\nDamping Coefficient\nFlap Mode\nk= 0.1\nTorsion Mode\nk= 1\nk= 0.7\nk= 0.4\nk= 0.2\nk= 1\nk= 0.7\nk= 0.4\nk= 0.2\nk= 0.1\nk= 1\nk= 0.7\nk= 0.4\nk= 0.2\nk= 0.1\nEdgewise Mode\nFigure 19: Damping Coefficient as a fucntion of IBFA and reduced frequency for the flap\n(left), torsion (middle) and edge-wise (right) modes. The fundamental modeshapes are described in Fig. 18. The edgewise and ﬂap modes are deﬁned as\nbending modes along and perpendicular to the chord. The centre of torsion of the third fundamental\nmode is located at the l.e.", "48": "of the airfoil. The airfoil used in all the simulations corresponds to the\nmid-section of a representative rotor blade (αinlet = 37◦, αexit = 64◦, Mis = 0.76 Re = 2.5 × 105). Modern LPTs may have large separation bubbles on the pressure side side of the airfoils that may not be\naccounted for using inviscid simulations. They induce phase shifts in the p.s. of the airfoil whose relative\nimportance depends on the case.", "49": "Usually, the contribution to the work per cycle of the airfoil pressure\nside is smaller than that of the suction side. However to avoid any further problems, all the simulations\nperformed in the present study have retained viscous eﬀects since its extra cost compared to the inviscid\nsimulations is negligible. Figure 19 shows the damping coeﬃcient as a function of the IBPA for the diﬀerent fundamental modes\npreviously described. In general the IBPA may be deﬁned as σ = 2π(m −1)/NS where m = 1 . .", "50": ". Ns and\nNs is the number of sectors. For a freestanding airfoil Ns = Nblades. The stabilizing eﬀect of the reduced\nfrequency can be seen for all the modes but there is always a region of unstable IBPA for the computed\nrange of reduced frequencies. Torsion modes are the most unstable ones, this is a quite general trend,\nbut all the modes may become unstable if the reduced frequency is low enough .", "51": "More details may be\nfound in [3]. For low reduced frequencies non-dimensional work-per-cycle has a sine-like dependency with the inter-\nblade phase-angle. This is a clear indication that the destabilizing eﬀect is due to the presence of\nimmediately adjacent airfoils. The damping curves show as well some spikes superimpose to the sine-like\ncurves that are due to acoustic resonances at the inlet and outlet of the airfoil and that show-up in the\nsimulations. The IBPA at which the resonances occurs increases with the reduced frequency.", "52": "It is clear\nRTO-EN-AVT-207 \n6 - 17 \n \n\n3\nUnsteady Aerodynamics\nVKI-LS Structural Design of Aircraft Engines\n18\nFigure 20: Physics of a low-pressure turbine aerodamping\nthat for high enough reduced frequency all the modes may be stabilized being the frequency at which\nthis happens mode dependent. Figure 20 summarises well understood unsteady eﬀects of a single low-pressure turbine airfoil at relatively\nlow reduced frequencies (k ≃0.2) for a torsion about the l.e. mode. The simulations of the fundamental modes for a single airfoil indicate that, the most unstable IBPA is\naround ±90◦, depending on the mode, while the σ = 0◦and σ = 180◦are only slightly damped. This\nbehaviour may be readily understood by noting that the modulus of the unsteady pressure for the σ = 0◦\ncase is much smaller than for the σ = 180◦case.", "53": "This is sketched in Fig. 20 where the modulus of\nthe unsteady pressure generated by the airfoil vibrating in torsion about the leading edge for σ = 0◦,\nσ = 90◦and σ = 180◦are displayed. It is clearly seen that the modulus of the unsteady pressure is\nvery small for σ = 0◦since the relative displacement between the two airfoils in the throat region is very\nsmall compared to the one that is obtained for σ = 180◦, where both airfoils move in anti-phase. For an\nσ = 90◦the modulus of the unsteady pressure lies in between the other two. Since the work per cycle depends strongly on the phase between the unsteady pressure and the blade\ndisplacement this aspect is reviewed in the following lines.", "54": "Figure 20 (middle) displays the unsteady\npressure phase for the σ = 0◦, σ = 90◦and σ = 180◦. It is important to recall that the unsteady\npressure on the suction side (ﬁlled symbols) is signiﬁcantly larger than the one on the pressure side (open\nsymbols). Therefore, only the phase of the former will be discussed. The phase of σ = 0◦, and σ = 180◦\nis zero in ﬁrst approximation. This means that, both modes are neutral from a stability point of view.", "55": "When the blade moves closing the throat, the pressure is increased in that region, tending to damp the\nvibration in that part of the cycle but that energy is transmitted back to the airfoil in the second part of\nthe cycle. The damping for σ = 180◦is dominated by the pressure side which is the only region with a\nnon-null phase with the airfoil. The most critical IBPAs are those in which the modulus of the unsteady\npressure is high and the pressure raise when the airfoil moves opening the throat (i.e. when the motion\nof the suction-side neighboring airfoil closing the throat leads the motion of the reference airfoil)\nTwo diﬀerent concepts are used in the industry to migitate ﬂutter in turbines. The most standard and\nwidespread solution is the use of interlock rotors where the rotor blade shrouds are let to get in contact\n \n \n6 - 18 \nRTO-EN-AVT-207 \n \n\n19\nVKI-LS Structural Design of Aircraft Engines\n3\nUnsteady Aerodynamics\nCantilever\nWelded−pair\nInterlock\nFigure 21: Different solutions adopted to mitigate flutter on turbine airfoils\nFigure 22: Mach number flow-field of a choked compressor\nto increase the frequency of the assembly, especially for high NDs, and modify the mode-shapes.", "56": "Se\nsecond solution, adopted whenever possible in the RR group is the used of welded-in-pair rotor blades,\nthat do not increase signiﬁcantly the natural frequencies of the bladed-disk but increase dubstantially\nthe aerodynamics damping (see Figure 21)\nCompressor Choke Flutter\nCompressors operate in a wide range of pressure ratios and shaft speeds that give rise to quite diﬀerent\nbase ﬂow-ﬁelds. A particular case is that in which there is a shock wave inside the compressor passage\nas it is depicted in ﬁgure 22. The shock-wave extends from the trailing-edge of the suction side to the\ncompressor side. In this case the instability is caused by the shock wave oscillation between neighbouring\nairfoils caused by the airfoil vibration that modiﬁes the throat area. The instability occurs at large reduced\nfrequencies (k ≫0.3−0.4) and the sensitivity to this parameter is low.", "57": "Choke ﬂutter is less common than\nother types of compressor ﬂutter and it is usually experienced by middle and rear compressor stages. The numerical prediction of the instability is diﬃcult (author?) [4] since this is the result of the com-\npensation of two large quantities as it is sketched in ﬁgure 23. The oscillation of the shock-wave causes\nlarge unsteady perturbations in its vecinity, both in the pressure and suction sides. The pressure side is\nstabilizing while the suction side is instabilizaing.", "58": "The global result depends on the substraction of both\nquantities. The problem is highly non-linear since the perturbations caused by the oscillation of the shock-wave are\nlarge. In this case it has been shown that the stability of the system depends on the vibration amplitude. For small amplitudes the system may be unstable, but for large vibration amplitudes the non-linearity\nmay lead to an stable situation as it is shown in ﬁgure\nRTO-EN-AVT-207 \n6 - 19 \n \n\n3\nUnsteady Aerodynamics\nVKI-LS Structural Design of Aircraft Engines\n20\nx/c (%)\n0\nDamping Coefficient\nPressure Side\nStable\nUnstable\nSuction Side\n25\n50\n75\n0\n100\nFigure 23: Damping coefficient distribution of the pressure (solid line) and suction side\n(dashed line) of a choke compressor. Figure 24: Stability of a choked compressor as a function the vibration amplitude\nComputation of Unsteady Forces\nThe Navier-Stokes equations in conservative form can be written as\ndU\ndt = R(U),\n(32)\nwhere U are the conservative variables.", "59": "The ﬂow may be decomposed in two parts: a steady ﬂow and a\nsmall harmonic unsteady perturbation:\nU(x, t) = U0(x) + Re(bu(x)eiωt)\n(33)\nwhere U0 is the background steady or mean ﬂow and bu is the complex perturbation. The unsteady\nperturbation u ≪Uo. The background steady ﬂow is solved using the fully non-linear steady RANS\nequations. The equations may be linearised about the mean ﬂow to obtain\ndu\ndt = A(U0)u. (34)\nAerodynamic forces are usually computed in a very speciﬁc form:\n1.", "60": "Harmonic in time. This allows to:\n(a) Transform the Navier-Stokes equations to the Fourier space (u= ˆueiωt) to remove the time\ndependent character of the equations\niωˆu = A(U0)ˆu\n(35)\n(b) Solve the resulting set of complex equations in a pseudo-time,τ, to speed-up the convergence\n \n \n6 - 20 \nRTO-EN-AVT-207 \n \n\n21\nVKI-LS Structural Design of Aircraft Engines\n4\nFlutter Stability\nk b\nk d\ny\ni\nM i\nm i\nx i\nF\nF\nF\nj\nj+1\nj−1\na\na\na\nFigure 25: Mass-spring lumped model including aerodynamic forces\nof the system. du\ndτ + iωˆu = A(U0)ˆu\n(36)\n2. Travelling-Wave form, or in other words constant IBPA. This allows to reduce the computational\ndomain to a single passage using phase shifted boundary conditions and avoid the computation of\nthe ﬂow-ﬁeld in the whole bladed-disk wheel, signiﬁcantly reducing the computational time.", "61": "The\nphase-shifted boundary conditions in the Fourier space may be expressed as:\nc.c. : ˆu(θ0 + pitch) = ˆu(θ)eiσ\n(37)\nwhere σ is the inter-blade phase-angle. The same condition may be expressed in the physical domain\nas u(θ0 + pitch, t) = u(θ, t −∆T). The system is solved Nω×Nσtimes where Nω is the number of frequencies (family modes) to be considered,\nNσ is the Number of IBPAs, if all of them are computed them Nσ= 2 NDs. This is about 10× to\n100× times more eﬃcient than solving the time-dependent non-linear equations and reaching a periodic\nconverged state.", "62": "Most if not all gas turbine manufacturers follow this approach. 4\nFlutter Stability\nFlutter is an aeromechanic instability and therefore requires the joined formulation of the aerodynamic\nand the structural problem to derive any meaningful result. Here we will ﬁrst introduce the aerodynamic\nforces in our simpliﬁed lumped model and then we will generalised the formulation to arbitrary bladed-\ndisks. Aeroelastic Lumped Model\nThe basic lumped model that we have used in previous sections may be extended to include the aerody-\nnamic forces due to the motion of the arfoil itself. The governing equations of the disk are not modiﬁed\nMDisk\nd2xj\ndt2 = kdisc(xj+1 −xj) −kdisc(xj −xj−1) + kblade(yj −xj)\n(38)\nbut the rotor blade equation have to include the motion dependent aerodynamic forces, F a\nj ,\nmb\nd2yj\ndt2 = −kblade(yj −xj) + F a\nj (x1, x2, .", "63": ". . , xN, ω)\n(39)\nThe most distintive characterisitics of the aerodynamic forces is that they couple the motion of all the\nblades while the coupling through the disk elastic forces just couples the neighbouring sector, i.e. : sector\nj is only coupled with sectors j ± 1. Obviously the aerodynamic inﬂuence of near-by airfoils is greater\nthan that that are far apart, but conceptually all the blades are coupled through the aerodynamics.", "64": "Even\nRTO-EN-AVT-207 \n6 - 21 \n \n\n4\nFlutter Stability\nVKI-LS Structural Design of Aircraft Engines\n22\nif the disk is inﬁnitely stiﬀand we decouple the blades from the disk assuming that xj = 0 for all j\nresulting in a set of N independent equations, the aerodynamics recouples all the blades because the the\nmotion of the airfoil j inﬂuence the rest of the blades. The non-dimensional form of the equation is:\nµd2xj\ndτ 2\n=\nκ(xj+1 −2xj + xj−1) + (yj −xj)\nd2yj\ndτ 2\n=\n−(yj −xj) + eF a(x1, . . . , xN)\n(40)\nwhere µ = M\nm , κ = kdisk\nkblade\n, τ = t\ntc\n, tc =\nr\nm\nkblade\n= ω−1\na\nas it has been mentioned before.", "65": "Aerodynamics\nis a small correction of the structural problem. Non-dimensional forces, eF a = F a/mω2\na, are of the\norder of the critical damping ratio, ξ, typically around 10−2. To further progress in the understanding of the ﬂutter problem is essential to ﬁrst understand how the\naerodynamic forces interact with the structure, and how they are computed. This is better seen recurring\nto a more generic formulation that eventually could be applied to any bladed-disk. Formulation of the Tuned Flutter Problem\nThe equations of motion for the small amplitude vibration of a perfectly tuned bladed disk with N\nidentical sectors, in the absence of any external forcing except for the linear aerodynamic eﬀects, take\nthe form\nM¨x + Kx = L(x)aero,\n(41)\nwhere the bladed disk degrees of freedom (after an appropriate FEM discretization) are stored in x(t), M\nand K are the mass and stiﬀness matrices, both symmetric and positive deﬁnite, and Laero accounts for\nthe aerodynamic forces.", "66": "Structural damping has been neglected; the only source of damping considered\nin the formulation above is that coming from the aerodynamic terms, which is typically the dominating\none for low reduced frequencies, see e.g. [? ]. The vibration modes of the system can be written using complex notation as\nx = Xeiωt + c.c.,\n(42)\nwhere the vibration mode shape X and the mode oscillation frequency and damping ω (c.c. stands for\nthe complex conjugate) are given by the following eigenvalue problem\n(K −ω2M)X = Maero(ω)X,\n(43)\nwhich requires the knowledge of the matrix of aerodynamic forces Maero as a function of ω.", "67": "The calcu-\nlation of Maero for a given ω value involves the solution of the linearized Navier-Stokes equations that\nprescribe the airﬂow around the blades for all linearly independent blade displacements. Therefore, the\ncomputation of the bladed disk vibration characteristics using the fully coupled structural-aerodynamic\nformulation given by Eqn. (43) is extremely costly and simply not realizable for any realistic conﬁguration\nof practical interest. The computational cost of this problem is drastically reduced if one takes into account the fact that the\naerodynamic eﬀects produce only small variations of the purely structural vibration frequencies. With\nthis idea in mind, we will ﬁrst rewrite Eqn.", "68": "(43) using the structural mode basis and then apply an\nasymptotic perturbation method to obtain the ﬁrst order aerodynamic correction of the purely structural\nvibration characteristics. This is a well known procedure to compute the aerodynamic stability properties\n \n \n6 - 22 \nRTO-EN-AVT-207 \n \n\n23\nVKI-LS Structural Design of Aircraft Engines\n4\nFlutter Stability\nof tuned bladed disks (see [? ? ] for a recent application of this approach in two and three dimensional\nconﬁgurations). Structural vibration modes.", "69": "If the response vector (42) is partitioned as\nX =\n\n\nX1\nX2\n...\nXN\n\n\n,\n(44)\nwith the vector Xj containing the displacements of the m degrees of freedom associated with sector j,\nthen the problem that gives the natural oscillations of the tuned bladed disk without aerodynamic eﬀects\n(Eqn. (43) with Maero = 0) takes the form\n(\n\n\nK\nKc\n0\n· · ·\nKT\nc\nKT\nc\nK\nKc\n· · ·\n0\n...\n...\nKc\n0\n· · ·\nKT\nc\nK\n\n\n−ω2\n\n\nM\nMc\n0\n· · ·\nM T\nc\nM T\nc\nM\nMc\n· · ·\n0\n...\n...\nMc\n0\n· · ·\nM T\nc\nM\n\n\n)\n\n\nX1\nX2\n...\nXN\n\n\n=\n\n\n0\n0\n...\n0\n\n\n,\n(45)\nwhere the m × m sector stiﬀness and mass matrices K and M are symmetric and the coupling between\nadjacent sectors is represented by the coupling stiﬀness and mass matrices Kc and Mc. In our model\nproblem the mass coupling matrix is Mc = 0 and the number of DOF of the sector is m = 2. The cyclic symmetry of the bladed disk (that is composed of a sector repeated N times and arranged\nperiodically) is now evident in the matrices in Eqn. (45) that exhibit a block circulant structure, i.e.,\neach row can be obtained from the previous one after a wrap-around forward block shift.", "70": "The associated\ncomplex eigenvectors\n\n\nX1\n...\nXj\n...\nXN\n\n\n=\n\n\nZkei( 2πk\nN )1\n...\nZkei( 2πk\nN )j\n...\nZkei( 2πk\nN )N\n\n\n,\nfor\nk = 1 . . . N,\n(46)\ncorrespond to travelling waves with k nodal diameters that, taking into account Eqn. (42), rotate around\nthe annulus with constant angular velocity\nω\n(2πk/N).", "71": "The complex vector Zk of size m contains the mode\nshape details and the only eigenvector variation from sector to sector is just a phase increment of amount\n2πk\nN (the so-called “interblade phase angle”). The vector Zk can be regarded as the k-th mode of the\ndiscrete Fourier transform of the N-periodic sequence of the sector degrees of freedom along the complete\nstructure, X1, . . . XN; recall that the relation between Fourier modes F1, .", "72": ". . FN and sector degrees of\nfreedom S1, . . .", "73": "SN is given by\nSj =\nN\nX\nk=1\nFkei( 2πk\nN )j,\nfor\nj = 1 . . . N,\nand\n(47)\nFk = 1\nN\nN\nX\nj=1\nSje−i( 2πj\nN )k,\nfor\nk = 1 . .", "74": ". N.\n(48)\nNote also that it is enough to consider the value of k modulo N; the change k →k +N, that corresponds\nto the addition of a complete turn around the rotor, leaves all the above expressions unchanged. This\neﬀectively means that the structure is symmetric and does not distinguish between forward and backward\nRTO-EN-AVT-207 \n6 - 23 \n \n\n4\nFlutter Stability\nVKI-LS Structural Design of Aircraft Engines\n24\ntravelling-waves. If we now insert expression (46) into Eqn. (45), N decoupled eigenvalue problems of size m are obtained\n((Kc −ω2Mc)ei( 2πk\nN ) + (Kc −ω2Mc)Te−i( 2πk\nN ) + K −ω2M)Zk = 0,\nfor\nk = 1 .", "75": ". . N,\n(49)\nwhich, for each k, have m real eigenvalues, ω2\nk1, . . .", "76": ", ω2\nkm ≥0, that give the oscillation frequencies of the\nstructure. The associated eigenvectors, Zk1, . . . , Zkm, are, in general, complex.", "77": "Notice that the cyclic\nsymmetry allows to drastically reduce the computational eﬀort required to obtain the vibration modes\nof the tuned bladed disk: from O(N 3m3) for solving Eqn. (45) to only O(Nm3) for the N eigenvalue\nproblems in Eqn. (46). The eigenvalue equation Eqn. (49) remains invariant under the changes\nk →N −k,\nω2\nk →ω2\nN−k\nand\nZk →¯ZN−k,\n(50)\nand thus, for every travelling wave rotating in one direction, there is also another identical one that rotates\nin the opposite direction with the same velocity.", "78": "This symmetry comes from the fact that the original\nsystem (41) remains unchanged after time is reversed, t →−t, because it does not exhibit any dissipation\nat all. Travelling wave modes come thus in counter-propagating pairs, except for those associated with\nk = 0 and k = N\n2 (present only for N = ˙2), which have real Zk and can be seen as non propagative\nstanding waves. Property (50) implies that the plot of the natural frequencies versus the number of nodal\ndiameters, k, is symmetric, and only its ﬁrst half (interblade phase angle from 0 to π) is normally plotted. Aerodynamic correction. In order to evaluate the aerodynamic correction of the vibration characteristics of the bladed disk it is\nconvenient to ﬁrst perform in Eqn.", "79": "(43) the following change of variables to a purely structural travelling\nwave basis\nX = PA,\n(51)\nwith\nP=\n1\n√\nN\n\n\nP1ei( 2π1\nN )1\n. . . PNei( 2πN\nN\n)1\n...\n...\nP1ei( 2π1\nN )j\n. .", "80": ". PNei( 2πN\nN\n)j\n...\n...\nP1ei( 2π1\nN )N\n. . . PNei( 2πN\nN\n)N\n\n\nand\nA=\n\n\nA1\n...\nAj\n...\nAN\n\n\n,\n(52)\nand where the vectors Aj = [Aj1, .", "81": ". . , Ajm]T contain the amplitudes of the diﬀerent travelling wave modes. The eigenvalue problem in Eqn. (43) takes now the form\n\n\nΩ2\n1 −ω2I\n.", "82": ". . 0\n...\n...\n...\n0\n. . .", "83": "Ω2\nN −ω2I\n\n\n\n\nA1\n...\nAN\n\n= PHMaero(ω)P\n\n\nA1\n...\nAN\n\n,\n(53)\nwith diagonal mass and stiﬀness matrices, see Eqs. (??) and (?? ), and block diagonal aerodynamic matrix\nPHMaero(ω)P =\n\n\nM1(ω)\n. .", "84": ". 0\n...\n...\n...\n0\n. . . MN(ω)\n\n,\n(54)\n \n \n6 - 24 \nRTO-EN-AVT-207 \n \n\n25\nVKI-LS Structural Design of Aircraft Engines\n4\nFlutter Stability\nas a result of the fact that the linearized aerodynamic ﬂow problem has also cyclic symmetry and,\ntherefore, the modes with diﬀerent nodal diameters are completely independent.", "85": "The fact that pressure travelling-waves with k nodal diameters are orthogonal to travelling-waves with\nj ̸= k nodal diameters, or in physical terms, that the work of pressure travelling-wave in the displacement\nof another travelling-wave is null, allows the diagonalization of the aerodynamic matrix in the TW basis. This makes that TWs are the aeroelastic modes of the tuned system. This fact has deep implications\nin the formulation of the problem and it is one of the reasons why unsteady aerodynamics is computed\nusing a single passage in the TW basis. Modes with diﬀerent natural frequencies are orthogonal also. This is why bladed-disk are designed\nto separate mode families.", "86": "Mode interaction is diﬃcult to predict an it is ultimately the instability\nmechanism of coalescence ﬂutter. This problem is sometimes impossible to avoid as it happens in vane\npackets, where several modes with nearly de same frequency exist for the same nodal diameter enabling\nthe possibility of interacting among them. This is a very speciﬁc topic and it will not be adressed here. The aerodynamic terms are small and give rise to a small correction of the purely structural vibration\nfrequencies. For a given structural frequency ω˜k˜j (corresponding to the ˜j-th travelling wave mode with\n˜k nodal diameters), its aerodynamically corrected counterpart ω is given by Eqn.", "87": "(53), and it can be\napproximately estimated if one takes into account the following:\n1. The modes with a diﬀerent number of nodal diameters are decoupled and do not play any role in\nthe correction of ω˜k˜j, that is,\nAk = 0,\nfor all\nk ̸= ˜k. (55)\n2. The ˜kj-th equation in Eqn. (53) reads\n(ω2\n˜kj −ω2)A˜kj =\nm\nX\nh=1\n[M˜k(ω)]jhA˜kh.", "88": "(56)\nThe corrected frequency ω is close to ω˜k˜j, but not to the other frequencies ω˜kj (we are implicitly\nassuming here that ω˜k˜j is well apart from the rest of the frequencies corresponding to the same\nnumber of nodal diameters ˜k). Therefore, if j ̸= ˜j the term (ω2\n˜kj −ω2) in the equation above is not\nsmall, but the aerodynamic terms, [M˜k(ω)]jh, are small and we can neglect them to obtain\nA˜kj = 0,\nfor all\nj ̸= ˜j. (57)\nIn other words, the rest of the travelling wave modes with ˜k nodal diameters and diﬀerent frequencies\ndo not contribute either to the correction of the ω˜k˜j in ﬁrst approximation. Flutter Computational Environment\nThere are a number of hierarchical approaches of increasing complexity and ﬁdelity to compute ﬂutter. The purpose here is not to review all these approaches and discuss their limitations and implications but\nto give the reader a perspective of what it could be considered has been the standard practice in the\nindustry during the last decade, but that is still in application today.", "89": "The standard approach today is to use the assumption that the aerodynamics gives rise just to a small\ncorrection of the purely structural modes. The ﬁrst step then is to compute using a FEM the natural\nfrequencies and mode-shapes of the modes suspicious to suﬀer from ﬂutter and construct a modal data\nbase. Simultaneously the base ﬂow for the operating condition of interest is computed using a non-\nlinear RANS solver.The structural grid containing the mode-shapes is interpolated and transferred to the\nRTO-EN-AVT-207 \n6 - 25 \n \n\n5\nAdvanced Topics\nVKI-LS Structural Design of Aircraft Engines\n26\n*.rhs\nNS−L = F\nDataBase\nModal\nCompute\nForcing\nTerms\nPLVIB\n3D N−L CFD\nAero BCs\nMean Flow\nMesh Generator\ni   t\nω\nX(x)e\nMoving Grid\nAerodynamic\nLinear CFD\nDamping Curve\nMistuning Effects\n(via *.wks)\nperturbation\nUnsteady\nN−L Friction\nAero−sol\nCFD Grid\nStructural FEM\nStable\nΘ\nσ\nξmin\nσ\nAmplitude\nt\nUncoupled Flutter System\nFigure 26: Flow Diagram of a flutter computational system based on a linear Uncoupled\napproach\naerodynamic grid and the displacements in the aerodynamic grid, due to the displacements caused by\nthe mode-shape in the aerodynamic surface, computed. The displacements together with the base-ﬂow\nsolution and the natural frequency are transferred to a frequency domain linearise RANS solver. The main\nobjective of using a linearised solver, as has been already explained, is to reduced the computational time.", "90": "Moreover frequency domain solvers allow easier implementation of more accurate boundary conditions. Once the aerodynamic damping of the selected family of modes has been computed it is corrected using a\nreduced order model to account for mistuning. If after taking into account mistuning corrections the mode\nis unstable then it may be attempted to estimate the vibration amplitude of the rotor blade retaining\nthe friction eﬀects due to the attachments. 5\nAdvanced Topics\nFlutter is deﬁned as an aeroelastic instability but the problem is actually much more complex. The linear\nformulation of the problem just allows to predict the behaviour of the system during the early stages\nof the problem when the vibration amplitudes are small enough.", "91": "During this phase unstable modes\ngrow exponentially with a growth rate dictated by the aerodynamics. The exponential growth of the\nperturbations can not be sustained in long term and when the vibration amplitude becomes large enough\nnon-linear terms become to play a role and the vibration amplitude saturates at a ﬁnite amplitude. The diﬀerent scenarios that may take place are sketched in ﬁgure 27 (left). If the ﬂow is stable the\nvibration amplitude is zero since all the modes are stable and the perturbations decay to zero. when\nthere are unstable modes several scenario are possible.", "92": "If the instability is very strong and cannot be\neﬀectively compensated by non-linear mechanisms the amplitude may become large enough to break the\nrotor blade. An intermediate situation is that the amplitude saturates at a ﬁnite amplitude. Then if\nthe amplitude, and therefore the alternate stresses, is low enough the airfoil may sustain the vibration\nindeﬁnitely and ﬂutter may be acceptable since stresses caused by the limit cycle correspond to inﬁnite\nlife in the Goodman diagram. Alternatively if the vibration amplitude is large enough the vibration may\nbe sustained only for a ﬁnite time and the component has ﬁnite life. Figure 27 (middle) displays an experimental Campbell diagram of a bladed-disk undegoing ﬂutter.", "93": "High\nlevel of alternate stresses may be seen at the frequency of the unstable mode for a wide range of the shaft\nspeed. The change in the shaft speed of the turbine implies changes both in the pressure level and the\nincidence. The higher in the pressure level, and hence the density, at the inlet of the turbine the higher\n \n \n6 - 26 \nRTO-EN-AVT-207 \n \n\n27\nVKI-LS Structural Design of Aircraft Engines\n5\nAdvanced Topics\nthe vibration amplitude. In this particular cases ﬂutter is superimposed with forced response, but onlt\nat the crossings. When the rotor airfoils are aerodynamically unstable, the blade vibration grows up to a point in which\nthe motion is non-linearly saturated by mechanical damping.", "94": "For cantilever rotor blades this is due to\nthe dry friction that takes place in the ﬁr-tree attachment since they are designed to avoid the contact\nbetween neighbouring shrouds or platforms. However in principle other devices such as under-platform\ndampers or cover plates may contribute to increase the damping of the rotor blade. In any case what is\nimportant at this point is to estimate the vibration level of the rotor blade, that ultimately will determine\nthe life of the component. The vibration amplitude of the airfoil is assumed to remain small enough to\nneglect aerodynamic non-linear eﬀects. The eﬀect of friction on aerodynamically unstable rotor blades from a conceptual point of view was\nﬁrst studied by Sinha and Griﬃn [5, 6].", "95": "To clarify some of the basic issues addressed in the present\ninvestigation it is interesting to review the main results obtained from a single degree of freedom problem. If the unsteady aerodynamics is linear, then the unsteady pressure scales with the vibration amplitude, δ,\nand hence the aerodynamic work per cycle scales as the square of the amplitude, Waero ∝δ2. The scaling\nof dry friction dissipation depends on the vibration amplitude. For very small vibration amplitudes\n(δ < δoff−set) the rotor blade is stuck on the attachment and the dissipation is null, provided that the\nmaterial structural dissipation is neglected. For large vibration amplitudes there is a macro displacement\nof the rotor blade in the attachment.", "96": "The tangential force is constant and therefore the work dissipated\nper cycle is proportional to the displacement, Wmacro ∝δ. Between both situations there is a regime,\nknown as micro-slip, where only a fraction of the contact surface is sliding. Diﬀerent models exist to\ndescribe this behaviour (see for instance the Midlin’s model [7] to describe the contact between two elastic\nspheres). What is important to highlight at this stage is that the work dissipated per cycle is of the form\nWaero ∝δn, with n > 2, typically n = 3. The situation is sketched in Fig.", "97": "When the rotor airfoils are aerodynamically unstable, the blade vibration\ngrows up to a point in which the motion is non-linearly saturated by mechanical damping. For welded-\nin-pairs rotor blades this is due to the dry friction that takes place in the ﬁr-tree attachment since they\nare designed to avoid the contact between neighbouring shrouds or platforms. However in principle other\ndevices such as under-platform dampers or cover plates may contribute to increase the damping of the\nrotor blade. In any case what is important at this point is to estimate the vibration level of the rotor\nblade, that ultimately will determine the life of the component. The vibration amplitude of the airfoil is\nassumed to remain small enough to neglect aerodynamic non-linear eﬀects.", "98": "The eﬀect of friction on aerodynamically unstable rotor blades from a conceptual point of view was\nﬁrst studied by Sinha and Griﬃn [5, 6]. To clarify some of the basic issues addressed in the present\ninvestigation it is interesting to review the main results obtained from a single degree of freedom problem. If the unsteady aerodynamics is linear, then the unsteady pressure scales with the vibration amplitude, δ,\nand hence the aerodynamic work per cycle scales as the square of the amplitude, Waero ∝δ2. The scaling\nof dry friction dissipation depends on the vibration amplitude. For very small vibration amplitudes\n(δ < δoff−set) the rotor blade is stuck on the attachment and the dissipation is null, provided that the\nmaterial structural dissipation is neglected.", "99": "For large vibration amplitudes there is a macro displacement\nof the rotor blade in the attachment. The tangential force is constant and therefore the work dissipated\nper cycle is proportional to the displacement, Wmacro ∝δ. Between both situations there is a regime,\nknown as micro-slip, where only a fraction of the contact surface is sliding. Diﬀerent models exist to\ndescribe this behaviour (see for instance the Midlin’s model [7] to describe the contact between two elastic\nspheres). What is important to highlight at this stage is that the work dissipated per cycle is of the form\nWaero ∝δn, with n > 2, typically n = 3.", "100": "The situation is sketched in Fig. 27 (right). The balance between the aerodynamic self-excitation and\nRTO-EN-AVT-207 \n6 - 27 \n \n\n5\nAdvanced Topics\nVKI-LS Structural Design of Aircraft Engines\n28\nFlutter\nForced Response\nShaft speed\nFrequency\nStable Aerodynamics\nInfinite Life\nNo Life\nFinite Life\nLog(time)\nAmplitude\nWaero δ\n2\nWmicro δ\n3\nWmacroδ\nδoff−set\nmicro\nW      = 0\nWcycle\nδ\n1\n2\n3\nFigure 27: Summary of different features of the Flutter problem during the non-linear sat-\nurated regime. Left: Scheme of the potential situations that may be encountered\nin an aerodynamically unstable problem. Left: Experimental Campbell diagram\nof an aerodynamically unstable LP turbine.", "101": "Right: Equilibrium chart between\nthe friction dissipation and aerodynamic work. the dry friction provides either one or three solutions, depending on the relative value between them. The trivial solution, δ = 0, is unstable and any small perturbation from δ = 0, moves the system towards\nthe solution 2, which is a stable cyclic limit. Solution 2 is an attractor and any perturbation of the\ncyclic limit comes back to the solution 2 unless we reach the amplitude δ3, which is an absolute stability\nlimit, since the solution 3 is unstable. Alternatively, if the aerodynamic self-excitation is too large, or\nthe friction work too low, the only solution is the trivial one and the system is unstable 27 (right).", "102": "The balance between the aerodynamic self-excitation and the dry friction provides either one or three\nsolutions, depending on the relative value between them. The trivial solution, δ = 0, is unstable and any\nsmall perturbation from δ = 0, moves the system towards the solution 2, which is a stable cyclic limit. Solution 2 is an attractor and any perturbation of the cyclic limit comes back to the solution 2 unless we\nreach the amplitude δ3, which is an absolute stability limit, since the solution 3 is unstable. Alternatively,\nif the aerodynamic self-excitation is too large, or the friction work too low, the only solution is the trivial\none and the system is unstable. Te consequences of ﬂutter are quite diﬀerent depending on the blade-disk conﬁguration.", "103": "Integral bladed-\ndisks (Blisks) may only saturate aeromechanic instabilities by means of material damping that is typically\nof the order of 0.1% of the critical damping ratio. Cantilever blade-disks are saturated by dry friction in\nthe contact surfaces such as ﬁr-tree attachments and interlock contact surfaces and therefore may sustain\nmoderate levels of instability. Saturation may be obtained as well by means of aerodynamics non-linear\neﬀects. This has been shown to happen is choke ﬂutter [4] which is a highly non-linear problem, but in\nthis case the saturation mechanisms are completly diﬀerent. The prediction and/or simulation of the vibration amplitude caused by the saturation by mechanical\ndamping of aerodynamically unstable bladed-diks is quite complex and it has been adressed just by a\nfew authors.", "104": "We have used numerical methods combined with friction prediction based on scaling laws\ntuned with engine data to predict the vibration amplitude of unstable low-pressure turbines [8, 9]. The\nphisics of the problem is not fully understood, espcially when there are several unstable modes however it\nis expected that the appearance of cost eﬀective fully-coupled non-linear methods will signiﬁcantly help\nto understand this complex dynamic problem [10]. Although a lot of research is still needed in this area\nwe will present here some results which are useful to understand the nature of ﬂutter .The details may\nbe found in [10]. A free ﬂutter numerical experiment is considered, i.e. : there is no external periodic forcing applied in the\nsimulation, but there are several unstable normal modes in the simulation.", "105": "The main parameters of this\ncase (aerodynamics, mass, stiﬀness, friction constants) have been set to reproduce a real LPT rotor; in\nparticular, the exit Mach number is 0.57, the reduced frequency k is 0.12 and the critical damping ratio ξ\nfor the most unstable mode is roughly 1.6% and corresponds to a ﬂap mode in the direction of the y axis\n(see ﬁgure 27, left). The unsteady aerodynamic simulations consider the 2-D mid-section of the rotor;\n \n \n6 - 28 \nRTO-EN-AVT-207 \n \n\n29\nVKI-LS Structural Design of Aircraft Engines\n5\nAdvanced Topics\nMa\nKa\nMf\nyj\nxj\nMa\nKa\nMf\nyj+1\nxj+1\nKa\nMf\nxj−1\nyj−1\nMa\nKf\nKf\nKf\n−3\n−2\n−1\n0\n1\n2\n3\nND \nUnstable\nStable\n0\n2\n4\n6\n8\nξ (%)\nLinear \nFigure 28: Description of a simplified fully coupled non-linear aeroelastic model. Left:\nTwo-dimensional flow about a LPT airfoil linked to the ground by a non-linear\nspring. Centre: Critical damping ratio of the linear aerodynamics problems as a\nfucntion of the Nodal Diameter. Right: Time evolution of the airfoil DOFs.", "106": "the grid for each passage contains approximately 7000 points. Taking into account the comparatively low\nfrequencies of the vibration, the turbulence is simulated applying the algebraic Baldwin-Lomax model\nwith a quasi-steady approach. The aerodynamic damping obtain using a series of linear analysis may be seen in Fig. 27, middle. It may\nbe seen that the system is highly unstable due to the selected reduced frequency k = 0.12 which is very\nlow and that several modes are unstable, the actual number depending on the number of airfoils of the\nconﬁguration.", "107": "A slight discontinuity may be seen around IBPA= 0◦due to the acoustic resonances. The ﬁrst test case considers a domain with six sectors. The objective of simulating just six sectors is to\nobserve the dynamics of a system with just two unstable modes. In this case we may see two pairs of\nbackward and forward TWs for the ND = 1 and 2 plus the TWs corresponding with the ND zero and\nthree, which are indistinguishable from the corresponding standing waves, totalizing six TWs. It may\nbe appreciated in Fig.", "108": "29that the forward TWs corresponding with the ND = 1 and 2 are unstable but\nwith a diﬀerent strength (ξND=1/ξND=2 ≃2.7) while the rest are stable. This diﬀerent growth rate of\nthe two modes eases the derivation of conclusions and their tracking during the temporal evolution. For\nthe initial condition of the simulation a single pair of blades is slightly displaced from its equilibrium\nposition; this generates a perturbation in all the diﬀerent TWs. The vibration amplitudes of the airfoil DoFs using this methodology is shown in Fig. 27 (right).", "109": "The\ntime scale is normalized with the nominal vibration period of the rotor blades (i.e. : the period obtained\nlinearizing the ﬁr-tree constraint and neglecting aerodynamic terms), making the horizontal axis roughly\nequivalent to the number of vibration periods. The vibration amplitude is normalized with an analytical\nestimate of the maximum vibration amplitude performed using the methodology described in [9]. In\npractical terms the reader may think that the vibration amplitde has been normalized using the maximum\ntheoretical vibration amplitude. Notice that both simulations get remarkably similar results; after an\ninitial development stage with an exponential growth of the amplitude, the vibration saturates at a\nconstant amplitude.", "110": "Figure 29 shows the solution post-processed using a wave-splitting method. Lines with diﬀerent colours\ndenote the evolution of diﬀerent TWs. The solid lines show the evolution of the TWs using the fully\ncoupled approach while dashed lines denote the simulation perform using the SUM approach. It may be\nnoticed the nearly exponential growth/decay during the early stages (5-7 ﬁrst periods) of the simulation;\nthis is in good agreement with classic linear aeroelasticity theory. In table 1 The critical damping ratio\nfor the one nodal diameter forward traveling wave, obtained from the growth rate in the ﬁrst periods of\nRTO-EN-AVT-207 \n6 - 29 \n \n\n5\nAdvanced Topics\nVKI-LS Structural Design of Aircraft Engines\n30\n0\n10\n20\n30\n40\n50\n60\n70\nNormalized Time\n10\n-4\n10\n-3\n10\n-2\n10\n-1\n10\n0\nNormalized Traveling Wave Amplitude\nND =   0\nND = +1\nND = +2\nND = +3\nND =  -2\nND =  -1\nND=0\nND=+1\nND=+2\nND=+3\nND=-2\nND=-1\nFigure 29: Time evolution of the traveling-wave amplitudes in a six-sector computational\ndomain\nTable 1: Six-sector computational domain:\ncritical damping ratio for the most unstable\ntraveling wave\nApproach\nξ\nFully Coupled\n1.79%\nSemi-Uncoupled\n1.53%\nLinear\n1.56%\nthe simulation, can be compared with the results from a classical linear methodology.", "111": "The agreement is\nnearly perfect for the semi-uncoupled methodology (see [10], but the diﬀerences with the fully coupled\nmethod are roughly 15%. The most unstable mode corresponds to the ND=+1. This is consistent with\nthe results displayed in Fig. 29. The behaviour of the traveling wave with nodal diameter zero (black line in Fig.", "112": "29) requires further\nexplanation. It must be taken into account that a steady aerodynamic force (lift) with a spatial pattern\ncorresponding to the ND = 0 appears in the simulation. This force was not taken into account in the\ndetermination of the initial location of the airfoils and in the long run it induces an oﬀ-set between\nthe initial and ﬁnal position of the airfoils, rather than an oscillation in the zero nodal diameter, which\njustiﬁes the weird behaviour shown in the graph. As the vibration amplitudes increase non-linear eﬀects begin to play a greater role (10-30 periods into the\nsimulation). In general, non linear terms allow the interaction of patterns with diﬀerent nodal diameters.", "113": "So, even though most waves should decay according to the linear theory, once the most unstable mode\nreaches a large enough vibration amplitude the system does not behave any longer linearly. Notice\nhowever that, in any case, the vibration amplitudes of the stable waves are 2-3 orders of magnitude\nsmaller than the amplitude of the most unstable mode. Close to the saturation (30-60 periods into the simulation) the growth rates for the unstable modes\ndecrease. Interestingly, while the most unstable mode tends towards a constant amplitude, the energy\nof the other unstable mode is drained and its amplitude limited to a fairly small value. This process is\nstill active even after the envelope of the physical amplitude of the blades has already reached saturation\n(about period 40).", "114": "This means that there is a non-linear process that adjusts the vibration phase of the\nairfoils at a fairly constant vibration amplitude. 6 - 30 \nRTO-EN-AVT-207 \n \n\n31\nVKI-LS Structural Design of Aircraft Engines\n5\nAdvanced Topics\n0\n2\n4\n6\n8\n10\nNormalized Frequency\n0\n0.25\n0.5\n0.75\n1\nNormalized Amplitude\nBlade DOF\nFir-tree DOF\nTime\n-0.15\n-0.05\n0.05\n0.15\nAmplitude\nTime\n-1.5\n-0.5\n0.5\n1.5\nAmplitude\nFigure 30: Six-sector model: temporal harmonic content of the periodic solution\n−18\n−180\n−9\n−90\n0\n0\n90\n180\nND \nIBPA (\nUnstable\nStable\no)\n−2\n0\n2\n4\n6\n8\nξ (%)\nLinear \n18\n9\nFigure 31: Aerodynamic Damping for the 36-sector model\nThis conclusion is quite remarkable since although in principle it could be thought that the saturated\nsolution could be made up of a blend of the two unstable modes, the non linearity of the ﬁr-tree ﬁlters\nout the second and transfer its energy to the most unstable mode. The conjecture is that when more\nthan two unstable modes exist a similar mechanisms will concentrate all the energy in a single mode as\nwell. Once the amplitude is saturated and most of the energy (more than 99.9%) is concentrated into the\nmost unstable mode the motion is nearly periodic. The results of performing a FFT using a sampling\nwindow of roughly 6 periods can be seen in ﬁgure 30.", "115": "Notice that for the blade DoF the motion is nearly\nsinusoidal, with negligible presence of higher harmonics. On the other hand, the ﬁr-tree DoF which is\ndirectly connected to the non-linear constraint shows signiﬁcant values of the ﬁrst odd harmonics. Using\nregression the best ﬁtting for the blade frequency has been found to be 2.61% higher than the nominal\nvibration frequency. Large Computational Domain\nThis case is identical to the six-sector model in the sense that both, the aerodynamic and structural\nparameters are the same, the sole diﬀerence is that we are including in the model thirty-six sectors that\nphysically corresponds to 72 rotor blades welded in pairs instead of six. Since we have now more DoFs\nthe dynamics of the problem is richer and more complex.", "116": "The unsteady aerodynamics associated to this\ncase is also that displayed in Fig. 31, however since in this conﬁguration we may accommodate more\nmodes we have consequently more unstable modes. Actually the forward traveling waves corresponding\nRTO-EN-AVT-207 \n6 - 31 \n \n\n5\nAdvanced Topics\nVKI-LS Structural Design of Aircraft Engines\n32\nFigure 32: 36 sector model: time evolution of the traveling waves\nto the ND = 2 −13, both included , are unstable. These twelve unstable modes have diﬀerent critical\ndamping ratio as it may be appreciated in Fig. 31.", "117": "The vibration amplitude of the airfoils saturates at nearly the same value than the model with six sectors. The same is true for the time needed to reach the amplitude saturation value. This eﬀectively means\nthat the growth rate of the instability in both cases is roughly the same, as could be expected, since the\nsix-sector model contains nearly the most unstable mode. Nevertheless, a more in depth analysis based on the tracking of the traveling-wave amplitudes (see Fig. 32) reveals that, even if the airfoil amplitudes have reached their ﬁnal saturated value, there is still\nenergy exchange among the diﬀerent unstable waves.", "118": "This is clearly seen between the non-dimensional\ntime 100 and 150, where it may be appreciated that many modes are still active. Every line of Figs. 32\nand 33 denotes the evolution of an aeroelastic mode (i.e. : a TW with a prescribed wave-length or ND),\nThe colour code is consistent between both ﬁgures, unfortunaely since every ﬁgure has 36 lines it is not\nappropriate to include the leyends in them. The reader muy pay attention to the colour code to compare\nthe diﬀerent ﬁgures.", "119": "The aerodynamic damping of the system obtained by two independent methods: (i) The RANS frequency\ndomain linear solver prescribing the frequency that is obtained assuming that the non-linear contact is\nﬁxed (solid line) and (ii) The analysis of the ﬁrst stages of the fully coupled non-linear method are very\nsimilar being the discrepancies associated to a slight shift of the vibration frequencies between the non-\nlinear and the linear method and the non-linearity itself. The main conclusion is that the aerodynamics\nof the system is linear since the fully non-linear time marching method provides nearly the same results\nthan the frequency domain linear methodology. The results depicted in Fig. 32 are not fully satisfactory since the do not allow to conclude which is the\nﬁnal state of the system. Our conjecture, that we have already used in previous works [8, 9], is that the\nﬁnal state of a bladed-disk system with multiple unstable modes of the same family in the absence of a\nperiodic forcing, includes just the most unstable mode.", "120": "Because of the limited amount of simulation time\nthe end time of Fig. 32 corresponds approximately to 150 periods. The results obtained for characteristic times of the order of several thousands of periods may be seen in\nFig. 33). It may be appreciated than for very long times just a single TW survives which, incidentally,\nwas the one predicted as most unstable by the linear method (the forward TW of the 7th nodal diameter).", "121": "This simulation, together with the one performed for the six-sector computational domain, conﬁrms that\nthe conjecture is true. The initial stages of the fully-non linear simulation are shown on the bottom of the\nsame ﬁgure. It is seen that the dynamics is the same than that of the semi-uncoupled approach and the\n \n \n6 - 32 \nRTO-EN-AVT-207 \n \n\n33\nVKI-LS Structural Design of Aircraft Engines\nReferences\nFigure 33: 36 sector model: long time evolution of the traveling waves\nnon-linearity is ﬁltering out the solution. There are clear indications that only a single model will survive\nin the long term. This simulation may be seen as a ﬁnal indication that the conjecture that we formulated\nis true.", "122": "Actually the most unstable mode, ND⋆, was not perturbed at all while ND = ND⋆± 1 were. However the dynamics select the most unstable mode although the were other very similar much larger\nat the initial stage. Acknowledgments\nI would like to thank here all the people that has contributed during many years to develop the under-\nstanding of Aeroelasticity both at Industria de Turbopropulsores S.A. and Universidad Politécnica de\nMadrid. This includes a large number of Master and Ph.D students and ITP research engineers. Among\nall of them I would like specially to thank Juan Manuel Gallardo that has been involved in the develop-\nment of all the ITP aeroelasticiy system from the very beginning.", "123": "I am also in great debt with Carlos\nVasco that developed the linear version of the aerodynamic suite of codes known as Mu2s2T. References\n[1] Corral, R., Gallardo, J. M., and Martel, C., “A Conceptual Flutter Analysis of a Packet f Vanes\nUsing a Mass-Spring Model,” Journal of Turbomachinery, Vol. 131, April 2009, pp. 021016–1–7. [2] Antona, R., Corral, R., Gallardo, J., and Martel, C., “Eﬀect of the Structural Coupling on the Flutter\nOnset of a Sector of Low-Pressure Turbine Vanes,” ASME Paper GT2010-23037, Proceedings of the\n55tht ASME Gas Turbine and Aero engine Congress, Exposition and Users Symposium, Glasgow,\nUK, June 2010.", "124": "[3] Corral, R., Gallardo, J., and Vasco, C., “Aeroelastic Stability of Welded-in-Pair Low Pressure Turbine\nRotor Blades: A Comparative Study Using Linear Methods,” Journal of Turbomachinery, Vol. 129,\nJanuary 2007, pp. 72–83. [4] Zhai, Y., Bladh, R., and Dyverfeldt, G., “Mistuned Aeroelastic Stability Assesment of an Industrial\nCompressor Blade,” ASME Paper GT2011-45800, Proceedings of the 56th ASME Gas Turbine and\nAero engine Congress, Exposition and Users Symposium, Vancouver, Canada, June 2011. [5] Sinha, A. and Griﬃn, J. H., “Friction Damping of Flutter in Gas Turbine Engine Airfoils,” AIAA\nJournal of Aircraft, Vol.", "125": "20, April 1983, pp. 372–376. RTO-EN-AVT-207 \n6 - 33 \n \n\nReferences\nVKI-LS Structural Design of Aircraft Engines\n34\n[6] Sinha, A. and Griﬃn, J. H., “Eﬀects of Friction Dampers on Aerodynamically Unstable Rotor Stages,”\nAIAA Journal, Vol. 23, No. 2, Feb 1985, pp.", "126": "262–270. [7] Midlin, R. D. and Deresiewicz, H., “Elastic Spheres in Contact Under Varying Oblique Forces,”\nJournal of Applied Mechanics, Vol. 20, 1953, pp. 327–344. [8] Corral, R. and Gallardo, J. M., “A Methodology for the Vibration Amplitude Prediction of Self-\nExcited Rotors Based on Dimensional Analysis,” ASME Paper 20005-GT-90668, Proceedings of the\n51st ASME Gas Turbine and Aero engine Congress, Exposition and Users Symposium, Barcelona,\nSpain, May 2006.", "127": "[9] Corral, R. and Gallardo, J., “Veriﬁcation of the Vibration Amplitude Prediction of Self-Excited LPT\nRotor Blades Using a Fully Coupled Time-Domain Non-Linear Method and Experimental Data,”\nASME Paper 2008-GT-51416, Proceedings of the 51st ASME Gas Turbine and Aero engine Congress,\nExposition and Users Symposium, Berlin, Germany, June 2008. [10] Corral, R. and Gallardo, J., “Non-Linear Dynamics of Multi-Mode Unstable Bladed-Disks: Part I\n- Description of a Canonical Model and Phenomenological Results,” ASME Paper GT2011-22943,\nProceedings of the 56tht ASME Gas Turbine and Aero engine Congress, Exposition and Users\nSymposium, Vancouver, Canada, June 2011. 6 - 34 \nRTO-EN-AVT-207"}