{"0": "Flutter Part 1: Fundamentals with quasi-steady\naerodynamic theory\nSina Stapelfeldt *\nImperial College London\nvon Karman Institute for Fluid Dynamics\n18 August 2022\nContents\n1\nIntroduction\n3\n2\nAeroelastic formulation\n5\n2.1\nTypical section\n. . . . .", "1": ". . . . .", "2": ". . . . .", "3": ". . . . .", "4": ". . . . .", "5": ". . . . .", "6": ". . . 5\n2.2\nEquation of motion . .", "7": ". . . . .", "8": ". . . . .", "9": ". . . . .", "10": ". . . . .", "11": ". . . . .", "12": ". . . . 6\n2.3\nNon-dimensionalisation .", "13": ". . . . .", "14": ". . . . .", "15": ". . . . .", "16": ". . . . .", "17": ". . . . .", "18": ". . . 8\n2.4\nSteady aerodynamic forces . .", "19": ". . . . .", "20": ". . . . .", "21": ". . . . .", "22": ". . . . .", "23": ". . . . .", "24": "9\n2.5\nQuasi-steady behaviour . . . . .", "25": ". . . . .", "26": ". . . . .", "27": ". . . . .", "28": ". . . . .", "29": ". . . . 9\n3\nCoupled bending-torsion flutter\n11\n4\nParameter dependency\n15\n4.1\nMass ratio .", "30": ". . . . .", "31": ". . . . .", "32": ". . . . .", "33": ". . . . .", "34": ". . . . .", "35": ". . . . .", "36": ". . . . .", "37": "15\n4.2\nFrequency ratio . . . . .", "38": ". . . . .", "39": ". . . . .", "40": ". . . . .", "41": ". . . . .", "42": ". . . . .", "43": ". . . 15\n4.3\nLocation of centre of mass and torsional axis . .", "44": ". . . . .", "45": ". . . . .", "46": ". . . . .", "47": "15\n5\nConclusions\n19\n*The author would like to thank Roger Zoepke-Sonntag for his contribution to these lecture notes, in\nparticular for proofreading, spotting mistakes in the equations and generally improving readability. VKI\n- 1 -\n\n\n1\nINTRODUCTION\n1\nIntroduction\nFlutter is a dynamic instability caused by the interaction of aerodynamic, elastic and\ninertial forces. It therefore belongs to the class of dynamic aeroelastic phenomena, oth-\ners being buffeting or gust response, and sits in the centre of Collar’s famous triangle\nof forces illustrated in Figure 1. Flutter causes uncontrolled vibration with rising am-\nplitude, and when the stress in the material exceeds steady or fatigue limits, it can\nultimately lead to the destruction of the structure. Unlike gust response or buffeting,\nflutter does not require any external forces.", "48": "It is the result of a positive feedback mech-\nanisms between deformation of the structure and resulting unsteady aerodynamic loads. It is commonly encountered in lifting surfaces, such as aircraft wings, tails and control\nsurfaces and also in wind turbine blades, rotor craft, turbomachinery blades, or even\nbridges. Famous examples of flutter are the first recorded flutter event of the Handley\nPage airplane in 1916 and the collapse of the Tacoma Narrows Bridge in 1940. Be-\ncause of the potentially catastrophic consequences, flutter must in general be completely\neliminated by design or at least prevented from occurring within the flight envelope. A\nhistorical review of flutter research is given, for example, by Garrick and Reed III (1981).", "49": "Figure 1: Collar’s triangle of forces\nTo design against flutter, the stiffness\nor mass distributions of the structure or\nits aerodynamics have to be changed. This\ntends to result in structures which are\nheavier than designs optimised for aero-\ndynamic performance (the so-called aeroe-\nlastic penalty). This is still a concern in\nmodern engineering and a lot of research\nis dedicated to the improvement of mod-\nelling and detection capabilities to design\nflutter-free structures, develop mitigation\nmeasures or implement automatic control\nmeasures. While most of the early research\non flutter was performed in wind tunnels or using analytical models, modern techniques\nemploy high-fidelity models of structural dynamics and aerodynamics to analyse the sta-\nbility of complex structures such as whole aircraft or multi-stage aero-engine compressors. Often, neither the mechanical properties nor the aerodynamics of such complex systems\nare completed understood or accurately modelled, and therefore experimental testing re-\nmains a vital part of the development process.", "50": "Although flutter is a complex phenomenon, the nature of flutter and its analysis tech-\nnique can be understood from the coupled structural and aerodynamic analysis of a sim-\nplified two-dimensional model. This lecture will introduce such a model, the governing\nequation and its stability analysis. The behaviour of the two-dimensional model is de-\nscribed by a linear set of structural dynamic equations which are coupled with a linear\nrepresentation of the aerodynamic forces resulting from the structural deformations. In\nthis lecture, the aerodynamic analysis is restricted to steady forces, which presents a sig-\nnificant limitation. When linear models for the unsteady aerodynamics are included, the\nanalysis is typically referred to as classical flutter analysis.", "51": "In reality both structural\nVKI\n- 3 -\n\n1\nINTRODUCTION\ndynamics and aerodynamics give rise to non-linear effects. The flow over the surface may\nseparate for part or all of the vibration cycle, leading to so-called stall flutter. Large\ndeflections, mechanical contacts or control systems may also introduce non-linearities. Typical flutter analysis concentrates on the stability of infinitesimal small deflections,\nsince it is undesirable for any system to be unstable when imposed to small random\nperturbations. Often, the introduction of non-linearities at larger deflections actually\nstabilises the system.", "52": "This is the case, for example, in stall flutter when flow separation\nlimits the amplitudes and leads to periodic limit-cycle oscillations. A discussion of unsteady forces and non-linearities is out of scope of this lecture, but\nsome methods for analysis with unsteady aerodynamics and non-linear effects will be\nintroduced in Part 2. The simplified treatment presented in the following is chosen to\ndemonstrate important characteristics of flutter instability and illustrate flutter analysis. VKI\n- 4 -\n\n2\nAEROELASTIC FORMULATION\n2\nAeroelastic formulation\n2.1\nTypical section\nA ‘typical section model’, which represents the cross section of a wing or rotor blade\nwill be used to demonstrate the stability analysis. This model has historically been used\nto perform flutter analyses.", "53": "It is an extremely simplified case which still shares many\nproperties with the more complex systems found across engineering applications. The\nmodel and nomenclature here follows closely those of\nHodges and Pierce (2011). A\nsimilar, more general analysis can be found in Bisplinghoff et al. (2013). A schematic of the typical two-dimensional section model is shown in Fig.", "54": "2. The\naerofoil section is elastically mounted on a set of discrete springs. In the standard case\nshown here with two degrees of freedom, these are a compression and a torsional spring\nrepresenting the structural bending and torsional stiffness of the three-dimensional wing. The corresponding two degrees of freedom are plunging and twisting, denoted by h and θ. The spring stiffness constants are accordingly labelled kh and kθ.", "55": "The spring are mounted\non the reference point labelled xR. The chord length is denoted by c but it is common to\nuse semi-chord b = c/2 as a reference length. Two more points of interest are the point where the aerodynamic forces are acting\non and the centre of mass xCM. To simplify the aerodynamic analysis, we will consider\nthe aerodynamic forces acting through the aerodynamic centre xAC. The offset between\nthe centre of mass and the reference point is defined as xR −xCM = b(e −a) = bxθ.", "56": "The incoming air is axial, such that the instantaneous incidence angle is equal to θ. This\nassumption is made for simplicity of the expressions in this example but it does not\nimpact the generality of the results since flutter stability concerns dynamic deviations\nfrom a given steady-state. In a real case, the wing would be at an angle of attack and θ\nwould represent the deviation from this angle. The generalized aerodynamic forces acting\nin the two degrees of freedom are given by\nFh = −L\n(1)\nFθ = MAC + (xR −xAC)L = MAC + b\n\u00121\n2 + a\n\u0013\nL\n(2)\nFigure 2: Typical section model\nVKI\n- 5 -\n\n2\nAEROELASTIC FORMULATION\n2.2\nEquation of motion\nwhere MAC is the moment about the aerodynamic centre. The second line is the moment\nacting on the centre of torsion.", "57": "It is here referred to as a generalized force, i.e. a force\nacting in the direction of the coordinate θ, to keep the notation general. In classical\nflutter, the lift and moment can be considered linear functions of the deformation (and\ntheir derivatives), i.e. L = (dCL/dθ)θ, where the lift curve slope dCL/dθ is constant in\nθ. Assuming steady flow and thin airfoil theory, they can be simplified significantly since\nL = 2πρU 2bθ and MAC = 0.", "58": "2.2\nEquation of motion\nThe equation of motion for this system for the plunge and twist degree of freedom is given\nby Eq. 3. For a derivation, the reader is referred to Hodges and Pierce (2011). \u0014 m\nmbxθ\nmbxθ\nIθ\n\u0015 \u0014¨h\n¨θ\n\u0015\n+\n\u0014kh\n0\n0\nkθ\n\u0015 \u0014h\nθ\n\u0015\n=\n\u0014Fh\nFθ\n\u0015\n(3)\nwhere Iθ = ICM + mb2x2\nθ and ICM is the moment of inertia about the centre of mass. The\nmass matrix includes off-diagonal terms mbxθ crossed by inertial coupling of the plunging\nand twisting motion.", "59": "Because the centre of mass is located a ahead of the torsional axis,\na vertical downward acceleration ¨h is accompanied by an inertial force m¨h acting in the\nupward direction through the centre of mass, which produces a positive moment about the\ncentre of gravity mbxθ¨h. Similarly, an angular acceleration ¨θ around the centre of torsion\nxR creates a linear acceleration of mbxθ¨θ at the centre of gravity, resulting in a symmetric\nmass matrix. The stiffness matrix is diagonal because the elastic forces are decoupled. The aerodynamic forces on the right hand side are the generalized forces acting in the\ntwo degrees of freedom, in this case lift and moment. They are more complicated and\ndepending on their exact nature introduce further coupling between the two degrees of\nfreedom, which will be seen later.", "60": "We will now make a few substitutions and manipulate the equations to arrive in a\nform which is more suitable for analysis. This follows the procedure in Hodges and Pierce\n(2011). Firstly, the structural stiffness will be expressed in terms of the natural frequencies\nof the in-vacuo system ωh =\np\nkh/m and ωθ =\np\nkθ/Iθ. (These can be obtained by setting\nthe right hand side of Eq. 3 to zero.)", "61": "Secondly, we change the plunge variable to h/b and\nmultiple the first equation by b. \u0014 mb2\nmb2xθ\nmb2xθ\nIθ\n\u0015 \u0014¨h/b\n¨θ\n\u0015\n+\n\u0014mb2ω2\nh\n0\n0\nIθω2\nθ\n\u0015 \u0014h/b\nθ\n\u0015\n=\n\u0014bFh\nFθ\n\u0015\n(4)\nNow, all the terms have the same units. As already mentioned, in classical flutter it is\nassumed that the aerodynamic forces are linear functions of the the plunging and twisting\ndisplacements and velocities: Fh = f(h/b, ˙h/b, θ, ˙θ), Fθ = g(h/b, ˙h/b, θ, ˙θ). Expressing\nthis relationship with complex coefficients, Fh = ˜Fhhh/b + ˜Fhθθ and Fθ = ˜Fθhh/b + ˜Fθθθ,\nthey can be further categorised into four components:\n˜Fhh =\nPlunging force due to plunging motion\n˜Fhθ =\nPlunging force due to twisting motion\n˜Fθh =\nTwisting force due to plunging motion\n˜Fθθ =\nTwisting force due to twisting motion\nVKI\n- 6 -\n\n2.2\nEquation of motion\n2\nAEROELASTIC FORMULATION\nThese force coefficients ˜F, also known as aerodynamic influence coefficients, can be inter-\npreted as the unsteady aerodynamic force resulting from a unit deflection in the generalised\ndisplacements h/b or θ. They are complex and the real part represents the component in\nphase with the displacement, while the imaginary part represents the component in phase\nwith the velocity.", "62": "Substituting the expressions for the aerodynamic forces into Eq. 4, the equation of\nmotion becomes:\n\u0014 mb2\nmb2xθ\nmb2xθ\nIθ\n\u0015 \u0014¨h/b\n¨θ\n\u0015\n+\n\u0014mb2ω2\nh\n0\n0\nIθω2\nθ\n\u0015 \u0014h/b\nθ\n\u0015\n=\n\u0014b ˜Fhh\nb ˜Fhθ\n˜Fθh\n˜Fθθ\n\u0015 \u0014h/b\nθ\n\u0015\n(5)\nIn this case, Eq. 5 is a set of linear ordinary differential equations which has general\nsolutions which are exponential functions of time:\nh(t) = ˜heλt\nθ(t) = ˜θeλt\n(6)\nwhere ˜h and ˜θ are complex amplitudes. Their real parts represent the vibration amplitudes\nand their relative phases represent the phase shift between the plunging and twisting\nmotion, i.e. the mode shape.", "63": "To keep the notation concise, we introduce the mass M, stiffness K and aerodynamic\nmatrices F and the generalised displacement vector q = [h/b\nθ]T = ˜qeλt:\nM ¨q −[K −F]q = 0\n(7)\nMaking the substitution q = ˜qeλt, Eq. 7 transforms into an eigenvalue problem:\nλ2I −M −1[K −F] = 0\n(8)\nThe roots are typically two complex conjugate pairs describing two vibration modes, for\nexample:\nλ1 = Γ1 ± iΩ1\nλ2 = Γ2 ± iΩ2\n(9)\n(3.1) ζ = 0.05\n(3.2) ζ = −0.05\nFigure 3: Time histories for stable, and unstable system where ω is the vibration frequency\nand T = 2π/ω is the vibration period. VKI\n- 7 -\n\n2\nAEROELASTIC FORMULATION\n2.3\nNon-dimensionalisation\nBy analogy to a spring-damper system (¨x + 2ζω ˙x + ω2x = 0), the complex eigenvalues\nrelate to the critical damping ratio ζ = −Γ/ω and natural frequency of the coupled\naeroelastic system ω = Ω/\np\n1 −ζ2. Typical responses for different values of Γ are shown\nin Fig. 3.", "64": "Looking at Eq. 7, it is possible to split the aerodynamic forces into real and imaginary\ncomponents when moving them to the left hand side. This is done by considering that\nFq = [ℜ(F) + iℑ(F)]q = ℜ(F)q + iℑ(F) ˙q\nλ since q = ˜qeλt and ˙q = ˜qλeλt = λq. M ¨q −[ℑ(F)/λ] ˙q + [K −ℜ(F)]q = 0\n(10)\nIn this form, it is clear that the aerodynamic forces introduce damping and modify the\neffective stiffness of the system. The last steps (from Eq.", "65": "7 apply to any aeroelastic system which can be modelled in\nterms of a set of generalized displacements, not just the typical section. 2.3\nNon-dimensionalisation\nEquation 5 can be solved as written. However, to understand the nature and character-\nistics of flutter it is more informative to express it in terms of non-dimensional variables. The aerodynamic forces on the right hand side are functions of the aerodynamic (lift and\nmoment) coefficients and can be written as:\n˜Fhh = ˜Chhρu2b\n˜Fhθ = ˜Chθρu2b\n˜Fθh = ˜Cθhρu2b2\n˜Fθθ = ˜Cθθρu2b2\n(11)\nSubstituting this into Eq. 5, manipulating the equations and identifying the non-dimensional\nparameters:\nMass ratio:\nµ = m/(ρπb2)\nFrequency ratio:\nσ = ωh/ωθ\nRadius of gyration:\nr =\np\nIθ/(mb2)\nReduced velocity:\nV = u/(bωθ)\n(12)\nwhere m is the mass per unit span.", "66": "The origin of the π in the definition of mass ratio lies\nin thin airfoil theory, and the mass ratio can thus be interpreted as the ratio of the mass\nof the blade to the mass of air in a circle with radius semi-chord. Eq. 5 can be rewritten as:\n1\nV 2ω2\nθ\n\u0014 1\nxθ\nxθ\nr2\n\u0015 \u0014¨h/b\n¨θ\n\u0015\n+\n\u0014σ/V 2\n0\n0\nr2/V 2\n\u0015 \u0014h/b\nθ\n\u0015\n= 1\nµ\n\u0014 ˜Chh\n˜Chθ\n˜Cθh\n˜Cθθ\n\u0015 \u0014h/b\nθ\n\u0015\n(13)\nEq. 13 is the non-dimensional equation of motion for a typical aerofoil section in plunging\nand twisting motion. This is an eigenvalue problem in terms of a new non-dimensional\neigenvalue, historically referred to as p = λb/u:\nVKI\n- 8 -\n\n2.4\nSteady aerodynamic forces\n2\nAEROELASTIC FORMULATION\np2I −[M ∗]−1[K∗−F ∗] = 0\n(14)\nwhere the ∗denotes the non-dimensional form of the mass, stiffness and aerodynamic\nmatrices.", "67": "The methods which determine stability from Eq. 14 are often referred to as p\nmethod after the non-dimensional complex eigenvalue. Depending on the nature of the right hand side, Eq. 13 can be solved analytically. In general, however, the aerodynamic force coefficients will be functions of the reduced\nfrequency of oscillation, k = fb/u, and Mach number and the system needs to be solved\niteratively.", "68": "This procedure is often referred to as the p-k method (Hassig (1971)). In this\nlecture, only steady aerodynamic forces will be considered. 2.4\nSteady aerodynamic forces\nEq. 13 simplifies significantly if all aerodynamic forces can be calculated from steady\nstate formulas. In this case the angle of attack is assumed to be the instantaneous angle\nof attack, i.e.", "69": "θ, and there are no aerodynamic loads resulting from the plunging motion. Assuming thin airfoil theory, this results in simple expressions for the aerodynamic force\nand moment coefficients: ˜Chh = ˜Cθh = 0 and ˜Chθ = −CL = −2π and ˜Cθθ = −2π(a + 1\n2). If these are substituted in Eq. 13, the eigenvalue problem becomes:\np2\n\u0014 1\nxθ\nxθ\nr2\n\u0015 \u0014˜h/b\n˜θ\n\u0015\n+\n\"\nσ2\nV 2\n2\nµ\n0\nr2\nV 2 −2\nµ(a + 1\n2)\n# \u0014˜h/b\n˜θ\n\u0015\n= 0\n(15)\nwhich can be solved directly for p = λb/u giving the damping and modal frequency for a\ngiven mass ratio, flight velocity and aerofoil geometry. This will be illustrated in Section 3.", "70": "2.5\nQuasi-steady behaviour\nIn a more sophisticated approximation, quasi-steady behaviour is assumed. In this case,\nthe unsteady forces become functions of the instantaneous angle of attack θ and its first\nand second derivatives, as well as the plunge velocity and acceleration:\nFhh = πρb2¨h + 2πρub˙h\n(16)\nFhθ = πρb2[u ˙θ −ba¨θ] + 2πρub[uθ + b(0.5 −a) ˙θ]\n(17)\nFθh = πρb3a¨h + 2πρub2(a + 0.5)˙h\n(18)\nFθθ = πρb2[−ub(0.5 −a) ˙θ −b2(1/8 + a2)¨θ]\n(19)\nAn explanation of this is out of the scope of this lecture but can be found in Bisplinghoff\net al. (2013) (Chapter 5). VKI\n- 9 -\n\n\n3\nCOUPLED BENDING-TORSION FLUTTER\n3\nCoupled bending-torsion flutter\nFigure 4: Example typical section with torsional centre located upstream of mid-chord\nTo demonstrate a typical flutter analysis, we will consider a specific aerofoil section\nwith steady aerodynamic forces as defined above. The aerodynamic centre will be placed\nat quarter chord, in accordance with thin airfoil theory.", "71": "Arbitrarily, we will place the\ncentre of mass a little upstream of mid-chord (e = −0.1) and the torsional axis further\nupstream a = −0.2, as sketched in Fig. 4. We select a mass ratio µ = 20, frequency ratio\nσ = 0.4 and radius of gyration r2 = 1/4. This results in a radius of gyration around the\ncentre of mass of r2\nCM = r2 −(e −a) = 0.05. In dimensional terms, this might be an aerofoil of chord length 1m with mass per unit\nspan of 15kg in an air stream of density 1kg/m3.", "72": "If the torsional frequency is ωθ=100Hz,\na reduced velocity V = 2 would correspond to a dimensional velocity u=100m/s. Assuming steady flow, the roots p of Eq. 15, will define the aeroelastic frequencies ω\n(k in non-dimensional form) and aerodynamic damping ratio ζ:\np = b\nU (Γ + iΩ) = b\nU\nh\nωζ + iω\np\n1 −ζ2\ni\n= kζ + ik\np\n1 −ζ2\n(20)\nFor ζ << 1, ω = ℑ(p)U/b, and ζ = −ℜ(p)/ℑ(p). Note that k here is the inverse of reduced\nvelocity and therefore defined based on semi-chord and frequency in Hz. In literature it\nis often also defined based on chord length and/or frequency in radians per second.", "73": "Figure 5 plots the aeroelastic frequency ω normalised by the natural frequency of the\ntwisting motion and the aerodynamic damping ratio ζ against the reduced velocity. As expected, at zero velocity (in absence of aerodynamic forces) there are two indepen-\ndent frequencies corresponding to one dominantly twisting and one dominantly plunging\nmode. There is a small coupling between these modes because of the off-diagonal terms\nin the mass matrix, introduced by the off-set of the torsional axis with respect to the\ncentre of mass. At this point, the real part (aerodynamic damping) is necessarily zero. As\nvelocity increases, the two frequencies become closer and at the flutter boundary, when\naerodynamic damping becomes negative, the two modes coalesce.", "74": "This type of instabil-\nity is called a coupled bending-torsion flutter because the instability is a results of the\nmerging of the two original modes. The roots are now complex conjugate pairs with one\nhaving a positive and one a negative real part. VKI\n- 11 -\n\n3\nCOUPLED BENDING-TORSION FLUTTER\nTo further demonstrate the nature of this instability, Fig. 6 shows the corresponding\neigenvectors which describe the relative magnitude and phase of the plunge and twist\ndisplacements at every reduced velocity. For velocities below the flutter velocity V < 1.8\nthere are two distinct mode shapes, Mode 1, is close to the in-vacuo plunging frequency\nand the magnitude of the plunge component is much larger than that of the twist.", "75": "Mode\n2 is twist-dominated as expected. As the aerodynamic forces increase, the non-dominant\ncomponents of each mode grow. At the critical velocity, two coupled modes emerge. For\none of them, the twist component is lagging the plunge component while for the other\nit is leading. This is illustrated in Fig.", "76": "7. Mode 1, where the twist component leads the\nplunge (red lines, ϕ > 0) is positively damped as seen Fig. 5. For a case 90 degrees, the\nmotion is such that the aerofoil is twisting downwards at the beginning of the downward\nstroke (max plunge displacement), and upward at the beginning of the upward stroke\n(see Figure 8). For the other mode (Mode 2) the twist is lagging the plunge component\n(blue lines, ϕ < 0).", "77": "In this case, the aerofoil is twisting upwards at the beginning of the\ndownward stroke and downwards at the beginning of the upward stroke. This is unstable. Figure 5: Aeroelastic frequency and aerodynamic damping as a function of reduced ve-\nlocity for a typical section free to move in plunge and twist\nThe above analysis has demonstrated how coupled bending-torsion flutter of a typical\naerofoil section occurs assuming steady aerodynamic loads. As previously mentioned, this\nis a radically simplified assumption but it nevertheless provides some insights into the\nmechanisms of instability (i.e. mode coupling).", "78": "It can also provide some insights into the\nimportance of the governing non-dimensional parameters, which will be shown in the next\nsection. VKI\n- 12 -\n\n3\nCOUPLED BENDING-TORSION FLUTTER\nFigure 6: Amplitude and phase of the plunge and twist component in the two aeroelastic\nmodes as a function of reduced velocity\nFigure 7: Displacement histories for the plunge and twist component in Mode 1 and Mode\n2 at V = 2\nVKI\n- 13 -\n\n3\nCOUPLED BENDING-TORSION FLUTTER\n(8.1) Twist leading the plunge (stable)\n(8.2) Twist lagging the plunge (unstable)\nFigure 8: Illustration of unstable and stable twist-plunge motion\nVKI\n- 14 -\n\n4\nPARAMETER DEPENDENCY\n4\nParameter dependency\nThe previous section explained flutter instability of an aerofoil cross-section under the\ninfluence of steady aerodynamic loads. The instability mechanism was shown to be caused\nby coupling of the two degrees of freedom (plunge and twist). Despite its simplicity, the\ntypical section demonstrates the important parameters governing stability, which will now\nbe discussed. From the non-dimensional form of the equation of motion Eq 15, five important pa-\nrameters can be identified: reduced velocity V , mass ratio µ, frequency ratio σ, torsional\naxis off-set xθ = (e −a) and the torsional axis location a.", "79": "The effect of reduced velocity\nhas already been shown in Fig. 5 and 6. The following will investigate the influence of\nthe three structural parameters on stability. 4.1\nMass ratio\nThe mass ratio is the parameter which scales the aerodynamic forces. Figure 9 shows the\naeroelastic frequency for a range of mass ratios for the example shown above.", "80": "Flutter\noccurs when the two modes coalesce. It is clear that the flutter speed increases with\nincreasing mass ratio. The higher the mass ratio, the lower is the influence of the aero-\ndynamic forces responsible for mode coupling. For a given aircraft and speed, mass ratio will change with altitude as air density\nchanges. The fact that low mass ratios are more critical, suggests that the sea level flutter\nboundary is lower than that at altitude.", "81": "Furthermore, it shows that coupled bending-\ntorsion flutter is less likely to occur on wings or blades with a high mass per unit span. Light aircraft and gliders with mass ratios <15 are more susceptible to flutter at low\nreduced velocities. General aviation mass ratios at sea level are approximately 10-20,\nwhile helicopter and aero-engine blades can reach 100 (Hodges and Pierce, 2011). 4.2\nFrequency ratio\nThe effect of frequency ratio on the aeroelastic eigenvalues is shown in Figure 10. As\nexpected, increasing frequency separation delays the flutter onset.", "82": "The behaviour is non-\nlinear and flutter velocity drops sharply as the frequency ratio approaches unity. For\nσ = 1 the bending and torsion frequencies would need to be in resonance. This can only\noccur for unusually high bending stiffness and unusual torsional stiffness, such that this\nis usually not a concern. It is possible to intentionally design the wing or blade structure\nto increase the frequency ratio and prevent coupled bending-torsion flutter. 4.3\nLocation of centre of mass and torsional axis\nThe off-diagonal terms in the mass matrix, i.e.", "83": "the distance xθ = (e −a)b between the\ntorsional centre and the centre of mass determines the level of structural coupling between\nthe two modes. If xθ > 0 the centre of mass lies downstream of the torsional axis as in\nthe example above. If xθ < 0 the centre of mass lies upstream of the torsional axis. Figure 11.1 shows the variation in flutter velocity for an example where the centre\nof mass is fixed at e = 0 as above, and the location of the torsional centre is varied. At\nVKI\n- 15 -\n\n4\nPARAMETER DEPENDENCY\n4.3\nLocation of centre of mass and torsional axis\nFigure 9: Influence of mass ratio, µ, on flutter speed (a=-0.2, e=-0.1, r2=0.25, σ=0.4)\na = −0.5 the torsional centre coincides with the aerodynamic centre at quarter chord, and\nthe matrix becomes singular.", "84": "As the torsional centre shifts away from the aerodynamic\ncentre, the stability boundary initially moves to lower velocities because the aerodynamic\nmoment induced by the lift force increases, but close to the centre of mass at e = 0, the\nflutter speed increases again. There is no more coupling when the centre of mass and\naerodynamic centre coincide for this simple example. Similarly, the effect of the static\nunbalance, i.e. the distance between the centre of mass and the torsional axis, is shown\nin Figure 11.2 for a fixed torsional axis. A large xθ increases structural coupling between\nthe modes.", "85": "VKI\n- 16 -\n\n4.3\nLocation of centre of mass and torsional axis\n4\nPARAMETER DEPENDENCY\nFigure 10: Influence of plunge-twist frequency ratio σ on flutter speed (a=-0.2, e=-0.1,\nr2=0.25, µ=25)\n(11.1) Variation of torsional axis location\n(11.2) Variation of static unbalance\nFigure 11: Flutter velocity as a function of torsional axis location for a typical section\nwith µ = 20, r2 = 0.25 and σ = 0.4. VKI\n- 17 -\n\n\nREFERENCES\n5\nConclusions\nThis lecture has introduced the aeroelastic analysis of a typical aerofoil section with two\ndegrees of freedom: plunging and pitching motion. While the stability analysis, i.e. the\nformulation and solution of an eigenvalue problem, is general, the results presented here\nonly apply to a typical section with specific structural parameters and assumes steady\naerodynamic forces. Nevertheless, a few general conclusions could be drawn:\n\u0088 Under the influence of aerodynamic forces, the system’s dynamics are modified.", "86": "The\naerodynamic forces change the stiffness and introduce damping. \u0088 An instability (negative damping) arises when the bending and torsion modes be-\ncomes coupled under the influence of aerodynamic forces. This occurs at a critical\nnon-dimensional flight speed. \u0088 For coupled bending-torsion flutter with steady aerodynamic forces, the magnitude\nof the damping depends on the phase-lag between the plunging and twisting motion. If the twisting motion leads the plunging motion, i.e.", "87": "the aerofoil is pitching upwards\nat the upward stroke, the system is unstable. \u0088 For a given structure, the flutter speed increases with altitude, such that the critical\nflutter condition ordinarily arises at sea level. \u0088 A large separation between the natural frequencies of the plunging and torsion mode\ndelays the onset of coupled bending-torsion flutter. Due to the assumptions made, the instabilities shown in the previous section are\nlimited to coupled bending-torsion instabilities and only occur at low mass ratios, when\nthere is some structural coupling between the modes. In reality, instability conditions are\nfar less restrictive.", "88": "Flutter in an isolated plunge or twisting mode is possible if there is a\nphase-lag between the aerodynamic forces and the structural motion, and very high mass\nratio structures such as helicopter or turbine blades can also become unstable. References\nBisplinghoff, R. L., Ashley, H., and Halfman, R. L. (2013). Aeroelasticity. Courier Cor-\nporation. Garrick, I. and Reed III, W. H. (1981).", "89": "Historical development of aircraft flutter. Journal\nof Aircraft, 18(11):897–912. Hassig, H. J. (1971). An approximate true damping solution of the flutter equation by\ndeterminant iteration.", "90": "Journal of Aircraft, 8(11):885–889. Hodges, D. H. and Pierce, G. A. (2011). Introduction to structural dynamics and aeroe-\nlasticity, volume 15. cambridge university press. VKI\n- 19 -"}